tutoriel.org
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+latex_header: \hypersetup{colorlinks=true,linkcolor=blue}

* Prérequis
** Installations
Après avoir installé Django (par exemple dans un environnement virtuel nommé ~django5~), si vous disposez de virtualenvwrapper, activez l'environnement virtuel dans un terminal en ligne de commande avec :
#+begin_src bash
workon django5 # suivant où vous avez installé Django
#+end_src

Le package *virtualenvwrapper* fournit des raccourcis pour travailler avec *virtualenv*, tels que *workon*, *mkvirtualenv* et autres. Il n'a rien à voir avec Django, mais est couramment utilisé à ses côtés.

source : https://virtualenvwrapper.readthedocs.io/en/latest/command_ref.html#workon

Ne pas utiliser d'environnement virtuel est également possible.


** Commande d'administration

~django-admin~ est l'utilitaire en ligne de commande de Django pour les tâches administratives.
Le script ~django-admin~ devrait se trouver dans votre chemin système si vous avez installé Django via pip. S'il ne se trouve pas dans votre chemin, vérifiez que votre environnement virtuel est activé.


Depuis un terminal en ligne de commande, la commande ~django-admin~ va afficher toutes les commandes disponibles.

#+begin_src fundamental 
check
compilemessages
createcachetable
dbshell
diffsettings
dumpdata
flush
inspectdb
loaddata
makemessages
makemigrations
migrate
optimizemigration
runserver
sendtestemail
shell
showmigrations
sqlflush
sqlmigrate
sqlsequencereset
squashmigrations
startapp
startproject
test
testserver
#+end_src 



* Création d'un projet

Source : https://docs.djangoproject.com/fr/5.0/intro/tutorial01/



** Exemple 

Depuis un terminal en ligne de commande, déplacez-vous à l'aide de la commande ~cd~ dans un répertoire dans lequel vous souhaitez conserver votre code, puis lancez la commande suivante :

#+begin_src bash :exports code
django-admin startproject mysite
#+end_src

Nous avons décidé ici d'appeler le projet ~mysite~ qui est un nom autorisé pour les raisons explicitées plus bas.


** Précautions de nommage



Vous devez éviter de nommer vos projets en utilisant des noms réservés de Python ou des noms de composants de Django. Cela signifie en particulier que vous devez éviter d'utiliser des noms comme *django* (qui entrerait en conflit avec Django lui-même) ou *test* (qui entrerait en conflit avec un composant intégré de Python).

Le nom ~mysite~ utilisé dans le tutoriel officiel Django est également utilisé ici. C'est un nom autorisé, mais ne donnez pas ce même nom à tous vos projets.

