tutoriel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2024-08-21 Wed 22:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Raoul Hatterer" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org373ba0e">1. Prérequis</a>
<ul>
<li><a href="#orgccf4f39">1.1. Installations</a></li>
<li><a href="#orgef11005">1.2. Commande d'administration</a></li>
</ul>
</li>
<li><a href="#orgcb7003a">2. Création d'un projet</a>
<ul>
<li><a href="#orgad318f5">2.1. Exemple</a></li>
<li><a href="#orgc60e4ba">2.2. Précautions de nommage</a></li>
<li><a href="#orgc8737a6">2.3. Fichiers créés</a></li>
</ul>
</li>
<li><a href="#orgbcdc8c4">3. Lancer le serveur de développement</a>
<ul>
<li><a href="#orgcd20474">3.1. Avertissement</a></li>
<li><a href="#org6cdf293">3.2. Commande pour lancer le serveur de développement</a></li>
</ul>
</li>
<li><a href="#orgdb579da">4. Création d'une application</a>
<ul>
<li><a href="#orgba1c510">4.1. Différence entre un projet et une application</a></li>
<li><a href="#org5a5280f">4.2. Création d'une application</a></li>
<li><a href="#org24e3069">4.3. Créations des vues</a>
<ul>
<li><a href="#orgf92879f">4.3.1. Principe</a></li>
<li><a href="#orgecfccaa">4.3.2. Exemple</a></li>
</ul>
</li>
<li><a href="#orga866a7b">4.4. Lier les vues aux urls</a>
<ul>
<li><a href="#org567fa3c">4.4.1. Principe</a></li>
<li><a href="#org4d7304e">4.4.2. Définir une URLconf pour l'application</a></li>
<li><a href="#org898e4c0">4.4.3. Inclure l'URLconf de l'application dans l'URLconf globale du projet</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org90b2d3d">5. Configuration de la base de données</a>
<ul>
<li><a href="#orgbdbe239">5.1. Choix de la base de données</a></li>
<li><a href="#org9bb2ba6">5.2. Création des tables associées</a></li>
<li><a href="#org4a6f1ca">5.3. Examen des tables de votre base de données</a></li>
<li><a href="#org2265308">5.4. Création des modèles</a>
<ul>
<li><a href="#orgc6725fb">5.4.1. Philosophie des modèles</a></li>
<li><a href="#orgf4a847c">5.4.2. Modèles dans notre application de sondage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbcb4609">6. Inclure l'application au projet</a>
<ul>
<li><a href="#org1e5109c">6.1. Philosophie</a></li>
<li><a href="#org8b26573">6.2. Étape 1 : créer ou modifier les modèles</a></li>
<li><a href="#orgcc0830e">6.3. Étape 2 : créer des migrations correspondant à ces changements</a></li>
<li><a href="#orgd0ef6bb">6.4. Étape 3 : appliquer ces modifications à la base de données</a></li>
</ul>
</li>
<li><a href="#org326c325">7. L'interface de programmation (API)</a>
<ul>
<li><a href="#org5c2323c">7.1. Importer les modèles d'une application</a></li>
<li><a href="#orgaeb13ec">7.2. Lister tous les objets (instances d'une classe de modèle)</a></li>
<li><a href="#org4ca7db7">7.3. Créer de nouveaux objets</a>
<ul>
<li><a href="#org44faaa7">7.3.1. Créer une nouvelle question</a></li>
<li><a href="#org228bf99">7.3.2. Sauvegarder une question dans la base de données</a></li>
<li><a href="#org06186e1">7.3.3. Ajouter des méthodes <code>__str__()</code> aux modèles</a></li>
<li><a href="#org17720b4">7.3.4. Ajouter une méthode à un modèle</a></li>
<li><a href="#orgd80938c">7.3.5. Afficher les choix associés à une question</a></li>
<li><a href="#orgb89bc7e">7.3.6. Créer de nouveaux choix associés à une question</a></li>
<li><a href="#org908e7ec">7.3.7. Relations</a></li>
</ul>
</li>
<li><a href="#org20cd1fc">7.4. Filtrer</a>
<ul>
<li><a href="#org9afb9d7">7.4.1. Filtrer les enregistrements par valeur de champ</a></li>
<li><a href="#org8038746">7.4.2. Filtrer les choix</a></li>
<li><a href="#orgb3a59a2">7.4.3. Filtrer puis supprimer</a></li>
</ul>
</li>
<li><a href="#orgb4043a9">7.5. Obtenir un objet</a></li>
<li><a href="#org100ff1f">7.6. Raccourci pour obtenir un objet par clé primaire</a></li>
</ul>
</li>
<li><a href="#org7343e30">8. Introduction au site d'administration de Django</a>
<ul>
<li><a href="#orgd188d83">8.1. Philosophie</a></li>
<li><a href="#orgbc43792">8.2. Création d'un utilisateur administrateur</a></li>
<li><a href="#org6648f1e">8.3. Démarrage du serveur de développement</a></li>
<li><a href="#orge406eee">8.4. Rendre l'application de sondage modifiable via l'interface d'admin</a></li>
</ul>
</li>
<li><a href="#org11b3497">9. Création de l'interface publique (les vues)</a>
<ul>
<li><a href="#org02a0a52">9.1. Aperçu</a></li>
<li><a href="#org0a25c83">9.2. Écriture de vues supplémentaires</a></li>
<li><a href="#org476a970">9.3. Transmission de paramètres aux vues</a></li>
<li><a href="#org44424fe">9.4. Écriture de vues qui font réellement des choses</a>
<ul>
<li><a href="#orgf3aba79">9.4.1. Codage en dur sans gabarit</a></li>
<li><a href="#orgf1ed87e">9.4.2. Codage avec gabarits</a></li>
<li><a href="#org40c7e95">9.4.3. Codage propre avec gabarits</a></li>
<li><a href="#orgee03790">9.4.4. Espace de noms des gabarits</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8929ac0">10. Écriture de formulaires</a>
<ul>
<li><a href="#org3a61c32">10.1. Écriture d'un formulaire minimal</a></li>
<li><a href="#org55b9b58">10.2. Un résumé rapide</a></li>
</ul>
</li>
<li><a href="#org70de290">11. Affichage des résultats</a>
<ul>
<li><a href="#org8924eec">11.1. Réécrivons la vue <code>results()</code> dans <code>polls/views.py</code> :</a></li>
<li><a href="#org5345bf0">11.2. Écrivons maintenant le gabarit <code>polls/results.html</code> :</a></li>
</ul>
</li>
<li><a href="#orgb5ac442">12. Utilisation des vues génériques</a>
<ul>
<li><a href="#orgb87b683">12.1. Écriture de l'URLconf</a></li>
<li><a href="#orgdffa37e">12.2. Écriture des vues</a></li>
</ul>
</li>
<li><a href="#org0784a3d">13. Introduction aux tests automatisés</a>
<ul>
<li><a href="#orgb386f2d">13.1. Que sont les tests automatisés ?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org373ba0e" class="outline-2">
<h2 id="org373ba0e"><span class="section-number-2">1.</span> Prérequis</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgccf4f39" class="outline-3">
<h3 id="orgccf4f39"><span class="section-number-3">1.1.</span> Installations</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Après avoir installé Django (par exemple dans un environnement virtuel nommé <code>django5</code>), si vous disposez de virtualenvwrapper, activez l'environnement virtuel dans un terminal en ligne de commande avec :
</p>
<div class="org-src-container">
<pre class="src src-bash">workon django5 <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">suivant o&#249; vous avez install&#233; Django</span>
</pre>
</div>

<p>
Le package <b>virtualenvwrapper</b> fournit des raccourcis pour travailler avec <b>virtualenv</b>, tels que <b>workon</b>, <b>mkvirtualenv</b> et autres. Il n'a rien à voir avec Django, mais est couramment utilisé à ses côtés.
</p>

<p>
source : <a href="https://virtualenvwrapper.readthedocs.io/en/latest/command_ref.html#workon">https://virtualenvwrapper.readthedocs.io/en/latest/command_ref.html#workon</a>
</p>

<p>
Ne pas utiliser d'environnement virtuel est également possible.
</p>
</div>
</div>


<div id="outline-container-orgef11005" class="outline-3">
<h3 id="orgef11005"><span class="section-number-3">1.2.</span> Commande d'administration</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>django-admin</code> est l'utilitaire en ligne de commande de Django pour les tâches administratives.
Le script <code>django-admin</code> devrait se trouver dans votre chemin système si vous avez installé Django via pip. S'il ne se trouve pas dans votre chemin, vérifiez que votre environnement virtuel est activé.
</p>


<p>
Depuis un terminal en ligne de commande, la commande <code>django-admin</code> va afficher toutes les commandes disponibles.
</p>

<div class="org-src-container">
<pre class="src src-fundamental">check
compilemessages
createcachetable
dbshell
diffsettings
dumpdata
flush
inspectdb
loaddata
makemessages
makemigrations
migrate
optimizemigration
runserver
sendtestemail
shell
showmigrations
sqlflush
sqlmigrate
sqlsequencereset
squashmigrations
startapp
startproject
test
testserver
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgcb7003a" class="outline-2">
<h2 id="orgcb7003a"><span class="section-number-2">2.</span> Création d'un projet</h2>
<div class="outline-text-2" id="text-2">
<p>
Source : <a href="https://docs.djangoproject.com/fr/5.0/intro/tutorial01/">https://docs.djangoproject.com/fr/5.0/intro/tutorial01/</a>
</p>
</div>



<div id="outline-container-orgad318f5" class="outline-3">
<h3 id="orgad318f5"><span class="section-number-3">2.1.</span> Exemple</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Depuis un terminal en ligne de commande, déplacez-vous à l'aide de la commande <code>cd</code> dans un répertoire dans lequel vous souhaitez conserver votre code, puis lancez la commande suivante :
</p>

<div class="org-src-container">
<pre class="src src-bash">django-admin startproject mysite
</pre>
</div>

<p>
Nous avons décidé ici d'appeler le projet <code>mysite</code> qui est un nom autorisé pour les raisons explicitées plus bas.
</p>
</div>
</div>


<div id="outline-container-orgc60e4ba" class="outline-3">
<h3 id="orgc60e4ba"><span class="section-number-3">2.2.</span> Précautions de nommage</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Vous devez éviter de nommer vos projets en utilisant des noms réservés de Python ou des noms de composants de Django. Cela signifie en particulier que vous devez éviter d'utiliser des noms comme <b>django</b> (qui entrerait en conflit avec Django lui-même) ou <b>test</b> (qui entrerait en conflit avec un composant intégré de Python).
</p>

<p>
Le nom <code>mysite</code> utilisé dans le tutoriel officiel Django est également utilisé ici. C'est un nom autorisé, mais ne donnez pas ce même nom à tous vos projets.
</p>
</div>
</div>
