tutoriel.org
** Fichiers créés



#+begin_src fundamental
mysite/
    manage.py
    mysite/
        __init__.py
        settings.py
        urls.py
        asgi.py
        wsgi.py
#+end_src



On voit que le nom choisi pour le projet (ici ~mysite~) à donné lieu à la création de deux répertoires imbriqués portant ce nom.


- Le premier répertoire racine ~mysite/~ est un contenant pour votre projet. Son nom n'a pas d'importance pour Django ; vous pouvez, sans conséquences, le renommer comme vous le voulez par la suite. 

Ce que contient le répertoire racine :

- ~manage.py~ : un utilitaire en ligne de commande qui vous permet d'interagir avec ce projet Django de différentes façons.  Il fait la même chose que ~django-admin~ mais définit également la variable d'environnement ~DJANGO_SETTINGS_MODULE~ pour la faire pointer sur le fichier ~settings.py~ du projet. Généralement, en travaillant dans un seul projet Django, il est plus simple d'utiliser ~manage.py~ plutôt que ~django-admin~. Si vous devez basculer entre différents fichiers de réglages Django, utilisez la variable ~DJANGO_SETTINGS_MODULE~ ou l'option de ligne de commande ~--settings~ de la commande ~django-admin~.
- le sous-répertoire ~mysite/~ correspond au paquet Python effectif de votre projet (le renommer est possible, mais fortement déconseillé car cela implique d'avoir à modifier tous les fichiers du projet où ~mysite~ est importé, par exemple ~manage.py~, ~wsgi.py~, ~asgi.py~ et ~settings.py~, et de mettre à jour les imports pour refléter le nouveau nom du répertoire). Donc choisissez bien le nom de votre projet à sa création.

Ce que contient ce sous répertoire :

- ~__init__.py~ : un fichier vide qui indique à Python que ce répertoire doit être considéré comme un paquet.
- ~settings.py~ : réglages et configuration de ce projet Django.
- ~urls.py~ : les déclarations des URL de ce projet Django, une sorte de "table des matières" de votre site Django. 
- ~asgi.py~ : un point d'entrée pour les serveurs Web compatibles aSGI pour déployer votre projet (sans intérêt pour le développement).  
- ~wsgi.py~ : un point d'entrée pour les serveurs Web compatibles WSGI pour déployer votre projet (sans intérêt pour le développement).  


Remarque : 
#+begin_src bash :exports code
django-admin startproject mysite .
#+end_src
La commande précédente, du fait du point à la fin,  permet de créer un projet sans répertoire racine. 
C'est donc à vous de créer un répertoire au préalable et de vous y rendre avant de créer le projet avec cette commande. 

  
* Lancer le serveur de développement
** Avertissement
N'utilisez jamais le serveur de développement pour quoi que ce soit qui s'approche d'un environnement de production. Il est fait seulement pour tester votre travail pendant le développement.
** Commande pour lancer le serveur de développement

Depuis un terminal en ligne de commande, déplacez-vous à l'aide de la commande ~cd~ dans un répertoire dans lequel vous souhaitez avez placé votre projet, puis lancez la commande suivante :

#+begin_src bash :exports code
python manage.py runserver
#+end_src

Starting development server at http://127.0.0.1:8000/
Quit the server with CONTROL-C.


* Création d'une application

** Différence entre un projet et une application 
- Un projet est un ensemble de réglages et d'applications pour un site Web particulier.
- Une application est une application Web qui fait quelque chose (par exemple un système de blog, une base de données publique ou une petite application de sondage).
- Un projet peut contenir plusieurs applications.
- Une application peut apparaître dans plusieurs projets.

** Création d'une application
Pour créer votre application, assurez vous d'être dans le même répertoire que ~manage.py~ et saisissez cette commande :

#+begin_src bash :exports code
python manage.py startapp polls
#+end_src

Cela va créer un répertoire ~polls~, qui est structuré de la façon suivante :
#+begin_src fundamental :exports code
polls/
    __init__.py
    admin.py
    apps.py
    migrations/
        __init__.py
    models.py
    tests.py
    views.py
#+end_src

Cette structure de répertoire accueillera l'application de sondage.

** Créations des vues
*** Principe
- Lorsqu'une page est demandée, Django crée un objet ~HttpRequest~ contenant des métadonnées au sujet de la requête.
- Puis, Django charge la vue appropriée, lui transmettant l'objet ~HttpRequest~ comme premier paramètre.
- Chaque vue (telle que l'entend Django) est responsable de l'**action** suivante: prendre l'objet ~HttpRequest~ (et les métadonnées) et renvoyer un objet ~HttpResponse~. Et c'est tout !

Remarque: par la suite, nous verrons qu'en pratique, la partie visuelle proprement dite ne relève pas des "vues" ; elle relève des "templates".

*** Exemple  

Ouvrez le fichier ~polls/views.py~ et placez-y le code Python suivant :

#+begin_src python :exports code
from django.http import HttpResponse

# Première vue

def index(request):
    return HttpResponse("Hello, world. You're at the polls index.")

# Autres vues:

def detail(request, question_id):
    return HttpResponse(f"You're looking at question {question_id}")

def results(request, question_id):
    return HttpResponse(f"You're looking at the results of question {question_id}.")

def vote(request, question_id):
    return HttpResponse(f"You're voting on question {question_id}.")


#+end_src

La première vue est la vue la plus basique possible dans Django.

** Lier les vues aux urls
*** Principe

Pour accéder à une vue dans un navigateur, nous devons la mapper (établir une correspondance avec) à une URL.
Pour cela, nous devons définir une configuration d'URL, ou URLconf en abrégé.
Ces configurations d'URL sont définies dans chaque application Django au sein de fichiers Python nommés ~urls.py~.

*** Définir une URLconf pour l'application 

