tutoriel.html

<div id="outline-container-orgc8737a6" class="outline-3">
<h3 id="orgc8737a6"><span class="section-number-3">2.3.</span> Fichiers créés</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-fundamental">mysite/
    manage.py
    mysite/
        __init__.py
        settings.py
        urls.py
        asgi.py
        wsgi.py
</pre>
</div>



<p>
On voit que le nom choisi pour le projet (ici <code>mysite</code>) à donné lieu à la création de deux répertoires imbriqués portant ce nom.
</p>


<ul class="org-ul">
<li>Le premier répertoire racine <code>mysite/</code> est un contenant pour votre projet. Son nom n'a pas d'importance pour Django ; vous pouvez, sans conséquences, le renommer comme vous le voulez par la suite.</li>
</ul>

<p>
Ce que contient le répertoire racine :
</p>

<ul class="org-ul">
<li><code>manage.py</code> : un utilitaire en ligne de commande qui vous permet d'interagir avec ce projet Django de différentes façons.  Il fait la même chose que <code>django-admin</code> mais définit également la variable d'environnement <code>DJANGO_SETTINGS_MODULE</code> pour la faire pointer sur le fichier <code>settings.py</code> du projet. Généralement, en travaillant dans un seul projet Django, il est plus simple d'utiliser <code>manage.py</code> plutôt que <code>django-admin</code>. Si vous devez basculer entre différents fichiers de réglages Django, utilisez la variable <code>DJANGO_SETTINGS_MODULE</code> ou l'option de ligne de commande <code>--settings</code> de la commande <code>django-admin</code>.</li>
<li>le sous-répertoire <code>mysite/</code> correspond au paquet Python effectif de votre projet (le renommer est possible, mais fortement déconseillé car cela implique d'avoir à modifier tous les fichiers du projet où <code>mysite</code> est importé, par exemple <code>manage.py</code>, <code>wsgi.py</code>, <code>asgi.py</code> et <code>settings.py</code>, et de mettre à jour les imports pour refléter le nouveau nom du répertoire). Donc choisissez bien le nom de votre projet à sa création.</li>
</ul>

<p>
Ce que contient ce sous répertoire :
</p>

<ul class="org-ul">
<li><code>__init__.py</code> : un fichier vide qui indique à Python que ce répertoire doit être considéré comme un paquet.</li>
<li><code>settings.py</code> : réglages et configuration de ce projet Django.</li>
<li><code>urls.py</code> : les déclarations des URL de ce projet Django, une sorte de "table des matières" de votre site Django.</li>
<li><code>asgi.py</code> : un point d'entrée pour les serveurs Web compatibles aSGI pour déployer votre projet (sans intérêt pour le développement).</li>
<li><code>wsgi.py</code> : un point d'entrée pour les serveurs Web compatibles WSGI pour déployer votre projet (sans intérêt pour le développement).</li>
</ul>


<p>
Remarque : 
</p>
<div class="org-src-container">
<pre class="src src-bash">django-admin startproject mysite .
</pre>
</div>
<p>
La commande précédente, du fait du point à la fin,  permet de créer un projet sans répertoire racine. 
C'est donc à vous de créer un répertoire au préalable et de vous y rendre avant de créer le projet avec cette commande. 
</p>
</div>
</div>
</div>


<div id="outline-container-orgbcdc8c4" class="outline-2">
<h2 id="orgbcdc8c4"><span class="section-number-2">3.</span> Lancer le serveur de développement</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgcd20474" class="outline-3">
<h3 id="orgcd20474"><span class="section-number-3">3.1.</span> Avertissement</h3>
<div class="outline-text-3" id="text-3-1">
<p>
N'utilisez jamais le serveur de développement pour quoi que ce soit qui s'approche d'un environnement de production. Il est fait seulement pour tester votre travail pendant le développement.
</p>
</div>
</div>
<div id="outline-container-org6cdf293" class="outline-3">
<h3 id="org6cdf293"><span class="section-number-3">3.2.</span> Commande pour lancer le serveur de développement</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Depuis un terminal en ligne de commande, déplacez-vous à l'aide de la commande <code>cd</code> dans un répertoire dans lequel vous souhaitez avez placé votre projet, puis lancez la commande suivante :
</p>

<div class="org-src-container">
<pre class="src src-bash">python manage.py runserver
</pre>
</div>

<p>
Starting development server at <a href="http://127.0.0.1:8000/">http://127.0.0.1:8000/</a>
Quit the server with CONTROL-C.
</p>
</div>
</div>
</div>


<div id="outline-container-orgdb579da" class="outline-2">
<h2 id="orgdb579da"><span class="section-number-2">4.</span> Création d'une application</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgba1c510" class="outline-3">
<h3 id="orgba1c510"><span class="section-number-3">4.1.</span> Différence entre un projet et une application</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Un projet est un ensemble de réglages et d'applications pour un site Web particulier.</li>
<li>Une application est une application Web qui fait quelque chose (par exemple un système de blog, une base de données publique ou une petite application de sondage).</li>
<li>Un projet peut contenir plusieurs applications.</li>
<li>Une application peut apparaître dans plusieurs projets.</li>
</ul>
</div>
</div>

<div id="outline-container-org5a5280f" class="outline-3">
<h3 id="org5a5280f"><span class="section-number-3">4.2.</span> Création d'une application</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Pour créer votre application, assurez vous d'être dans le même répertoire que <code>manage.py</code> et saisissez cette commande :
</p>

<div class="org-src-container">
<pre class="src src-bash">python manage.py startapp polls
</pre>
</div>

<p>
Cela va créer un répertoire <code>polls</code>, qui est structuré de la façon suivante :
</p>
<div class="org-src-container">
<pre class="src src-fundamental">polls/
    __init__.py
    admin.py
    apps.py
    migrations/
        __init__.py
    models.py
    tests.py
    views.py
</pre>
</div>

<p>
Cette structure de répertoire accueillera l'application de sondage.
</p>
</div>
</div>

<div id="outline-container-org24e3069" class="outline-3">
<h3 id="org24e3069"><span class="section-number-3">4.3.</span> Créations des vues</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgf92879f" class="outline-4">
<h4 id="orgf92879f"><span class="section-number-4">4.3.1.</span> Principe</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>Lorsqu'une page est demandée, Django crée un objet <code>HttpRequest</code> contenant des métadonnées au sujet de la requête.</li>
<li>Puis, Django charge la vue appropriée, lui transmettant l'objet <code>HttpRequest</code> comme premier paramètre.</li>
<li>Chaque vue (telle que l'entend Django) est responsable de l'<b><b>action</b></b> suivante: prendre l'objet <code>HttpRequest</code> (et les métadonnées) et renvoyer un objet <code>HttpResponse</code>. Et c'est tout !</li>
</ul>

<p>
Remarque: par la suite, nous verrons qu'en pratique, la partie visuelle proprement dite ne relève pas des "vues" ; elle relève des "templates".
</p>
</div>
</div>

<div id="outline-container-orgecfccaa" class="outline-4">
<h4 id="orgecfccaa"><span class="section-number-4">4.3.2.</span> Exemple</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Ouvrez le fichier <code>polls/views.py</code> et placez-y le code Python suivant :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.http <span style="color: #0000FF;">import</span> HttpResponse

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Premi&#232;re vue</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">index</span>(request):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(<span style="color: #008000;">"Hello, world. You're at the polls index."</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Autres vues:</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">detail</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(f<span style="color: #008000;">"You're looking at question </span>{question_id}<span style="color: #008000;">"</span>)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">results</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(f<span style="color: #008000;">"You're looking at the results of question </span>{question_id}<span style="color: #008000;">."</span>)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">vote</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(f<span style="color: #008000;">"You're voting on question </span>{question_id}<span style="color: #008000;">."</span>)


</pre>
</div>

<p>
La première vue est la vue la plus basique possible dans Django.
</p>
</div>
</div>
</div>

<div id="outline-container-orga866a7b" class="outline-3">
<h3 id="orga866a7b"><span class="section-number-3">4.4.</span> Lier les vues aux urls</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org567fa3c" class="outline-4">
<h4 id="org567fa3c"><span class="section-number-4">4.4.1.</span> Principe</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Pour accéder à une vue dans un navigateur, nous devons la mapper (établir une correspondance avec) à une URL.
Pour cela, nous devons définir une configuration d'URL, ou URLconf en abrégé.
Ces configurations d'URL sont définies dans chaque application Django au sein de fichiers Python nommés <code>urls.py</code>.
</p>
</div>
</div>
