tutoriel.org
**** Exemple

Pour définir une URLconf pour l'application de sondages, créez un fichier ~polls/urls.py~ avec le contenu suivant :

#+begin_src python name='polls/urls.py' :exports code
from django.urls import path

from . import views

urlpatterns = [
    # ex: /polls/
    path("", views.index, name="index"),
]
#+end_src

**** La fonction ~path(route, view, kwargs=None, name=None)~

La fonction ~path()~ reçoit quatre paramètres, dont deux sont obligatoires : ~route~ et ~view~, et deux facultatifs : ~kwargs~ et ~name~.

À ce stade, il est intéressant d'examiner le rôle de chacun de ces paramètres:

- Premier paramètre de ~path()~ : ~route~

 - ~route~ est une chaîne contenant un *motif d'URL*.
 - Lorsqu'il traite une requête, Django commence par le premier motif dans ~urlpatterns~ puis continue de parcourir la liste en comparant l'URL reçue avec chaque motif jusqu'à ce qu'il en trouve un qui correspond.
 - Les motifs ne cherchent pas dans le nom de domaine, ni dans les paramètres GET et POST.
 - Par exemple : 
  - dans une requête vers ~https://www.example.com/myapp/~, l'URLconf va chercher ~myapp/~ ;
  - dans une requête vers ~https://www.example.com/myapp/?page=3~, l'URLconf va aussi chercher ~myapp/~.


- Deuxième paramètre de ~path()~ : ~view~

 - Lorsque Django trouve un motif correspondant, il appelle la fonction de vue spécifiée, avec un objet ~HttpRequest~ comme premier paramètre et toutes les valeurs capturée par la route sous forme de paramètres nommés.


- Troisième paramètre de ~path()~ : ~kwargs~

 - Comme nous allons le voir prochainement, les configurations d'URL ont un troisième point d'entrée facultatif qui permet de passer des paramètres supplémentaires à vos vues, via un dictionnaire Python. 

- Quatrième paramètre de ~path()~ : ~name~

 - Le nommage des URL permet de les référencer de manière non ambiguë depuis d'autres portions de code Django, en particulier depuis les gabarits. Cette fonctionnalité puissante permet d'effectuer des changements globaux dans les modèles d'URL de votre projet en ne modifiant qu'un seul fichier.

**** Sur l'utilité de ~name~ dans les gabarits utilisant ~url~

Source : https://stackoverflow.com/a/68307313/5952631

Une petite partie d'un gabarit ~index.html~ pouvant être:
#+begin_src html :exports code
    <a href="{% url 'index'                 %}">index</a>
    <a href="{% url 'detail'  question_id=1 %}">detail</a>
    <a href="{% url 'results' question_id=1 %}">results</a>
#+end_src

Comme cela est évident, cela montre des liens. Mais, notez ici, à
l'intérieur de la balise ~<a>~, l'utilisation de la balise ~url~ de Django.

Le format correct d'utilisation de la balise url de Django dans les gabarits est :
~{% url 'NAME OF URL here' any_variables_here %}~

~NAME OF URL~ signifie le nom que nous donnons à une URL dans l'argument ~name~ de ~path()~,
ce qui signifie que nous devons uniquement utiliser le nom de l'URL dans l'attribut ~href~,
nous n'avons plus besoin d'utiliser l'URL complexe partout dans notre code,
c'est une fonctionnalité géniale de Django.

**** Répertoire de l'application

Votre répertoire d'applications devrait maintenant ressembler à :

#+begin_src fundamental :exports code
polls/
    __init__.py
    admin.py
    apps.py
    migrations/
        __init__.py
    models.py
    tests.py
    urls.py
    views.py
#+end_src

*** Inclure l'URLconf de l'application dans l'URLconf globale du projet

**** Exemple
#+begin_src python :exports code name="mysite/urls.py"
from django.contrib import admin
from django.urls import include, path

urlpatterns = [
    # permet d'inclure l'URLconf de l'application 
    path("polls/", include("polls.urls")), 
    path("admin/", admin.site.urls),
]

#+end_src

**** La fonction ~include()~

La fonction ~include()~ permet de référencer et d'inclure d'autres configurations d'URL. Quand Django rencontre un ~include()~, il tronque le bout d'URL qui correspondait jusque là et passe la chaîne de caractères restante à la configuration d'URL incluse pour continuer le traitement.

Exemple :

 1. Lorsque l'utilisateur visite l'URL http://monsite.com/polls/, Django cherche une correspondance dans le fichier ~urls.py~ principal. La partie de l'URL ~polls/~ correspond à ~path('polls/', include('polls.urls'))~. Django tronque cette partie (c'est-à-dire qu'il la supprime) et passe le reste de l'URL (~""~ ici, car il n'y a rien après ~polls/~) au fichier ~urls.py~ de l'application ~polls~.

 2. Django continue maintenant à chercher une correspondance dans ~polls/urls.py~. Ici, ~path('', views.index, name='index')~ correspond, car l'URL restante est vide (~""~). La vue ~views.index~ est appelée.

 3. Si l'utilisateur visite http://monsite.com/polls/5/vote/, Django tronque ~polls/~ et passe le reste de l'URL (~5/vote/~) à ~polls/urls.py~. Ici, ~path(<int:question_id>/vote/, views.vote, name='vote')~ correspond, et la vue ~views.vote~ est appelée avec ~question_id=5~.

L'utilisation de ~include()~ permet donc à Django de structurer les URL de manière hiérarchique et modulaire, facilitant la maintenance et l'extension du projet.
L'idée derrière ~include()~ est de faciliter la connexion d'URL. Comme l'application de sondages possède son propre URLconf (polls/urls.py), ses URL peuvent être injectés sous  ~/polls/~ , sous ~/fun_polls/~ ou sous ~/content/polls/~ ou tout autre chemin racine sans que cela change quoi que ce soit au fonctionnement de l'application.


**** Quand utiliser include()

Alors que ~admin.site.urls~ utilise systématiquement ~path()~ et qu'on pourrait ajouter d'autre urls dans l'URLconf globale grâce à ~path()~,  il est plutôt conseillé d'utiliser ~include()~ lorsque l'on veut inclure d'autres motifs d'URL. Ces motifs d'urls seront alors placés dans les URLConf des applications où l'on fera usage de ~path()~. 

Cela permet de structurer les URL de manière modulaire, en les séparant en plusieurs fichiers de configuration.



