tutoriel.html

<div id="outline-container-org4d7304e" class="outline-4">
<h4 id="org4d7304e"><span class="section-number-4">4.4.2.</span> Définir une URLconf pour l'application</h4>
<div class="outline-text-4" id="text-4-4-2">
</div>
<ol class="org-ol">
<li><a id="orge8e68e8"></a>Exemple<br />
<div class="outline-text-5" id="text-4-4-2-1">
<p>
Pour définir une URLconf pour l'application de sondages, créez un fichier <code>polls/urls.py</code> avec le contenu suivant :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.urls <span style="color: #0000FF;">import</span> path

<span style="color: #0000FF;">from</span> . <span style="color: #0000FF;">import</span> views

<span style="color: #BA36A5;">urlpatterns</span> = [
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ex: /polls/</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">""</span>, views.index, name=<span style="color: #008000;">"index"</span>),
]
</pre>
</div>
</div>
</li>

<li><a id="orgd03e026"></a>La fonction <code>path(route, view, kwargs=None, name=None)</code><br />
<div class="outline-text-5" id="text-4-4-2-2">
<p>
La fonction <code>path()</code> reçoit quatre paramètres, dont deux sont obligatoires : <code>route</code> et <code>view</code>, et deux facultatifs : <code>kwargs</code> et <code>name</code>.
</p>

<p>
À ce stade, il est intéressant d'examiner le rôle de chacun de ces paramètres:
</p>

<ul class="org-ul">
<li>Premier paramètre de <code>path()</code> : <code>route</code>

<ul class="org-ul">
<li><code>route</code> est une chaîne contenant un <b>motif d'URL</b>.</li>
<li>Lorsqu'il traite une requête, Django commence par le premier motif dans <code>urlpatterns</code> puis continue de parcourir la liste en comparant l'URL reçue avec chaque motif jusqu'à ce qu'il en trouve un qui correspond.</li>
<li>Les motifs ne cherchent pas dans le nom de domaine, ni dans les paramètres GET et POST.</li>
<li>Par exemple : 
<ul class="org-ul">
<li>dans une requête vers <code>https://www.example.com/myapp/</code>, l'URLconf va chercher <code>myapp/</code> ;</li>
<li>dans une requête vers <code>https://www.example.com/myapp/?page=3</code>, l'URLconf va aussi chercher <code>myapp/</code>.</li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Deuxième paramètre de <code>path()</code> : <code>view</code>

<ul class="org-ul">
<li>Lorsque Django trouve un motif correspondant, il appelle la fonction de vue spécifiée, avec un objet <code>HttpRequest</code> comme premier paramètre et toutes les valeurs capturée par la route sous forme de paramètres nommés.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Troisième paramètre de <code>path()</code> : <code>kwargs</code>

<ul class="org-ul">
<li>Comme nous allons le voir prochainement, les configurations d'URL ont un troisième point d'entrée facultatif qui permet de passer des paramètres supplémentaires à vos vues, via un dictionnaire Python.</li>
</ul></li>

<li>Quatrième paramètre de <code>path()</code> : <code>name</code>

<ul class="org-ul">
<li>Le nommage des URL permet de les référencer de manière non ambiguë depuis d'autres portions de code Django, en particulier depuis les gabarits. Cette fonctionnalité puissante permet d'effectuer des changements globaux dans les modèles d'URL de votre projet en ne modifiant qu'un seul fichier.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org06597e7"></a>Sur l'utilité de <code>name</code> dans les gabarits utilisant <code>url</code><br />
<div class="outline-text-5" id="text-4-4-2-3">
<p>
Source : <a href="https://stackoverflow.com/a/68307313/5952631">https://stackoverflow.com/a/68307313/5952631</a>
</p>

<p>
Une petite partie d'un gabarit <code>index.html</code> pouvant être:
</p>
<div class="org-src-container">
<pre class="src src-html">    &lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"{% url 'index'                 %}"</span>&gt;index&lt;/<span style="color: #006699;">a</span>&gt;
    &lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"{% url 'detail'  question_id=1 %}"</span>&gt;detail&lt;/<span style="color: #006699;">a</span>&gt;
    &lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"{% url 'results' question_id=1 %}"</span>&gt;results&lt;/<span style="color: #006699;">a</span>&gt;
</pre>
</div>

<p>
Comme cela est évident, cela montre des liens. Mais, notez ici, à
l'intérieur de la balise <code>&lt;a&gt;</code>, l'utilisation de la balise <code>url</code> de Django.
</p>

<p>
Le format correct d'utilisation de la balise url de Django dans les gabarits est :
<code>{% url 'NAME OF URL here' any_variables_here %}</code>
</p>

<p>
<code>NAME OF URL</code> signifie le nom que nous donnons à une URL dans l'argument <code>name</code> de <code>path()</code>,
ce qui signifie que nous devons uniquement utiliser le nom de l'URL dans l'attribut <code>href</code>,
nous n'avons plus besoin d'utiliser l'URL complexe partout dans notre code,
c'est une fonctionnalité géniale de Django.
</p>
</div>
</li>

<li><a id="orgba6d5e8"></a>Répertoire de l'application<br />
<div class="outline-text-5" id="text-4-4-2-4">
<p>
Votre répertoire d'applications devrait maintenant ressembler à :
</p>

<div class="org-src-container">
<pre class="src src-fundamental">polls/
    __init__.py
    admin.py
    apps.py
    migrations/
        __init__.py
    models.py
    tests.py
    urls.py
    views.py
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org898e4c0" class="outline-4">
<h4 id="org898e4c0"><span class="section-number-4">4.4.3.</span> Inclure l'URLconf de l'application dans l'URLconf globale du projet</h4>
<div class="outline-text-4" id="text-4-4-3">
</div>
<ol class="org-ol">
<li><a id="org3b56c84"></a>Exemple<br />
<div class="outline-text-5" id="text-4-4-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.contrib <span style="color: #0000FF;">import</span> admin
<span style="color: #0000FF;">from</span> django.urls <span style="color: #0000FF;">import</span> include, path

<span style="color: #BA36A5;">urlpatterns</span> = [
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">permet d'inclure l'URLconf de l'application </span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"polls/"</span>, include(<span style="color: #008000;">"polls.urls"</span>)), 
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"admin/"</span>, admin.site.urls),
]

</pre>
</div>
</div>
</li>

<li><a id="org6d1b9ea"></a>La fonction <code>include()</code><br />
<div class="outline-text-5" id="text-4-4-3-2">
<p>
La fonction <code>include()</code> permet de référencer et d'inclure d'autres configurations d'URL. Quand Django rencontre un <code>include()</code>, il tronque le bout d'URL qui correspondait jusque là et passe la chaîne de caractères restante à la configuration d'URL incluse pour continuer le traitement.
</p>

<p>
Exemple :
</p>

<ol class="org-ol">
<li>Lorsque l'utilisateur visite l'URL <a href="http://monsite.com/polls/">http://monsite.com/polls/</a>, Django cherche une correspondance dans le fichier <code>urls.py</code> principal. La partie de l'URL <code>polls/</code> correspond à <code>path('polls/', include('polls.urls'))</code>. Django tronque cette partie (c'est-à-dire qu'il la supprime) et passe le reste de l'URL (<code>""</code> ici, car il n'y a rien après <code>polls/</code>) au fichier <code>urls.py</code> de l'application <code>polls</code>.</li>

<li>Django continue maintenant à chercher une correspondance dans <code>polls/urls.py</code>. Ici, <code>path('', views.index, name='index')</code> correspond, car l'URL restante est vide (<code>""</code>). La vue <code>views.index</code> est appelée.</li>

<li>Si l'utilisateur visite <a href="http://monsite.com/polls/5/vote/">http://monsite.com/polls/5/vote/</a>, Django tronque <code>polls/</code> et passe le reste de l'URL (<code>5/vote/</code>) à <code>polls/urls.py</code>. Ici, <code>path(&lt;int:question_id&gt;/vote/, views.vote, name='vote')</code> correspond, et la vue <code>views.vote</code> est appelée avec <code>question_id=5</code>.</li>
</ol>

<p>
L'utilisation de <code>include()</code> permet donc à Django de structurer les URL de manière hiérarchique et modulaire, facilitant la maintenance et l'extension du projet.
L'idée derrière <code>include()</code> est de faciliter la connexion d'URL. Comme l'application de sondages possède son propre URLconf (polls/urls.py), ses URL peuvent être injectés sous  <code>/polls/</code> , sous <code>/fun_polls/</code> ou sous <code>/content/polls/</code> ou tout autre chemin racine sans que cela change quoi que ce soit au fonctionnement de l'application.
</p>
</div>
</li>


<li><a id="org7d04a50"></a>Quand utiliser include()<br />
<div class="outline-text-5" id="text-4-4-3-3">
<p>
Alors que <code>admin.site.urls</code> utilise systématiquement <code>path()</code> et qu'on pourrait ajouter d'autre urls dans l'URLconf globale grâce à <code>path()</code>,  il est plutôt conseillé d'utiliser <code>include()</code> lorsque l'on veut inclure d'autres motifs d'URL. Ces motifs d'urls seront alors placés dans les URLConf des applications où l'on fera usage de <code>path()</code>. 
</p>

<p>
Cela permet de structurer les URL de manière modulaire, en les séparant en plusieurs fichiers de configuration.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
