tutoriel.org
* Configuration de la base de données

Source : https://docs.djangoproject.com/fr/5.0/intro/tutorial02/

** Choix de la base de données



La configuration par défaut utilise SQLite. Si vous débutez avec les bases de données ou que vous voulez juste essayer Django, il s'agit du choix le plus simple. Pour le stockage local des données avec une faible concurrence de l'écriture et moins d'un téraoctet de contenu, SQLite est la meilleure solution. SQLite est rapide et fiable et ne nécessite aucune configuration ou maintenance. SQLite est inclus dans Python, vous n'aurez donc rien d'autre à installer pour utiliser ce type de base de données.

SQLite fonctionne très bien comme moteur de base de données pour la plupart des sites Web à faible à moyen trafic (c'est-à-dire la plupart des sites Web). La quantité de trafic Web que SQLite peut gérer dépend de l'utilisation par le site Web de sa base de données. D'une manière générale, tout site qui obtient moins de 100 000 visites par jour devrait bien fonctionner avec SQLite.

S'il existe de nombreux programmes clients qui envoient SQL à la même base de données sur un réseau, utilisez un moteur de base de données client/serveur au lieu de SQLite. 

** Création des tables associées

La commande ~migrate~ examine le réglage ~INSTALLED_APPS~ dans votre fichier ~mysite/settings.py~ et crée les tables de base de données nécessaires en fonction des réglages de base de données et des migrations de base de données contenues dans l'application (nous les aborderons plus tard). Vous verrez apparaître un message pour chaque migration appliquée.

** Examen des tables de votre base de données

Pour afficher les tables créées par Django, si cela vous intéresse, lancez le client en ligne de commande de votre base de données. Par exemple pour SQLite:

#+begin_src bash name="SQLite"
sqlite3 db.sqlite3
#+end_src

Puis, tapez l'une des commandes suivantes:
- ~\dt~ (PostgreSQL),
- ~SHOW TABLES;~ (MariaDB, MySQL),
- ~.tables~ (SQLite) 
- ~SELECT TABLE_NAME FROM USER_TABLES;~ (Oracle) 

** Création des modèles

*** Philosophie des modèles


Dans la programmation orientée objet, un champ (ou attribut) est une propriété d'un objet. Cette propriété a un nom, un type de données et une valeur.

Un **modèle** est la source d'information unique et définitive pour vos données. Il contient les **champs** essentiels et le comportement attendu des données que vous stockerez. Django respecte la philosophie DRY (Don't Repeat Yourself), ne vous répétez pas. Le but est de définir le modèle des données à un seul endroit, et ensuite de dériver automatiquement ce qui est nécessaire à partir de celui-ci.

- **Un modèle équivaut à une table SQL et chaque modèle est représenté par une classe Python** (qui hérite de ~django.db.models.Model~).
- **Chaque champ correspond à une colonne dans une table SQL et chaque champ est représenté par un attribut de la classe Python correspondant au modèle.**

*** Modèles dans notre application de sondage

Nous allons créer deux modèles : ~Question~ et ~Choice~ (choix).
- Une Question possède deux champs : un énoncé de type ~CharField~ et une date de mise en ligne de type ~DateTimeField~.
- Un choix a deux champs : le texte représentant le choix et le décompte des votes. Chaque choix est associé à une Question.

Ces concepts sont représentés par des classes Python dont les attributs correspondent aux champs des modèles.

Éditez le fichier ~polls/models.py~ de façon à ce qu'il ressemble à ceci :

#+begin_src python :exports code
from django.db import models

class Question(models.Model):
    question_text = models.CharField(max_length=200)    # énoncé de la question
    pub_date = models.DateTimeField("date published")   # date de publication


class Choice(models.Model):
    question = models.ForeignKey(Question, on_delete=models.CASCADE)
    # chaque vote (Choice) n'est relié qu'à une seule Question
    choice_text = models.CharField(max_length=200)
    votes = models.IntegerField(default=0)

#+end_src


Ici, chaque modèle est représenté par une classe qui hérite de ~django.db.models.Model~.
Chaque modèle possède des attributs (variables de classe).
Chaque attribut représentant un champ de la base de données pour ce modèle.

Notez que nous définissons une relation, en utilisant ~ForeignKey~. Cela indique à Django que chaque vote (~Choice~) n'est relié qu'à une seule Question. Django propose tous les modèles classiques de relations : plusieurs-à-un, plusieurs-à-plusieurs, un-à-un.

Chaque autre attribut est un champ représenté par une instance d'une classe ~Field~ (par exemple, ~CharField~ pour les champs de type caractère, et ~DateTimeField~ pour les champs date et heure). Cela indique à Django le type de données que contient chaque champ.

Liste des champs proposés pas Django : 
https://docs.djangoproject.com/fr/5.0/ref/models/fields/#field-types

Le nom de chaque instance de ~Field~ (par exemple, ~question_text~ ou ~pub_date~) est le nom du champ en interne. Vous l'utiliserez dans votre code Python et votre base de données l'utilisera comme nom de colonne.

Vous pouvez utiliser le premier paramètre de position (facultatif) d'un Field pour donner un nom plus lisible au champ. C'est utilisé par le système d'introspection de Django, et aussi pour la documentation. Si ce paramètre est absent, Django utilisera le nom du champ interne. Dans l'exemple, nous n'avons défini qu'un seul nom plus lisible, pour ~Question.pub_date~. Pour tous les autres champs, nous avons considéré que le nom interne était suffisamment lisible.

Certaines classes Field possèdent des paramètres obligatoires. La classe ~CharField~, par exemple, a besoin d'un attribut ~max_length~. Ce n'est pas seulement utilisé dans le schéma de base de la base de données, mais également pour valider les champs, comme nous allons voir prochainement.

Un champ Field peut aussi autoriser des paramètres facultatifs ; dans notre cas, nous avons défini à 0 la valeur ~default~ de votes.



* Inclure l'application au projet

