tutoriel.html



<div id="outline-container-org90b2d3d" class="outline-2">
<h2 id="org90b2d3d"><span class="section-number-2">5.</span> Configuration de la base de données</h2>
<div class="outline-text-2" id="text-5">
<p>
Source : <a href="https://docs.djangoproject.com/fr/5.0/intro/tutorial02/">https://docs.djangoproject.com/fr/5.0/intro/tutorial02/</a>
</p>
</div>

<div id="outline-container-orgbdbe239" class="outline-3">
<h3 id="orgbdbe239"><span class="section-number-3">5.1.</span> Choix de la base de données</h3>
<div class="outline-text-3" id="text-5-1">
<p>
La configuration par défaut utilise SQLite. Si vous débutez avec les bases de données ou que vous voulez juste essayer Django, il s'agit du choix le plus simple. Pour le stockage local des données avec une faible concurrence de l'écriture et moins d'un téraoctet de contenu, SQLite est la meilleure solution. SQLite est rapide et fiable et ne nécessite aucune configuration ou maintenance. SQLite est inclus dans Python, vous n'aurez donc rien d'autre à installer pour utiliser ce type de base de données.
</p>

<p>
SQLite fonctionne très bien comme moteur de base de données pour la plupart des sites Web à faible à moyen trafic (c'est-à-dire la plupart des sites Web). La quantité de trafic Web que SQLite peut gérer dépend de l'utilisation par le site Web de sa base de données. D'une manière générale, tout site qui obtient moins de 100 000 visites par jour devrait bien fonctionner avec SQLite.
</p>

<p>
S'il existe de nombreux programmes clients qui envoient SQL à la même base de données sur un réseau, utilisez un moteur de base de données client/serveur au lieu de SQLite. 
</p>
</div>
</div>

<div id="outline-container-org9bb2ba6" class="outline-3">
<h3 id="org9bb2ba6"><span class="section-number-3">5.2.</span> Création des tables associées</h3>
<div class="outline-text-3" id="text-5-2">
<p>
La commande <code>migrate</code> examine le réglage <code>INSTALLED_APPS</code> dans votre fichier <code>mysite/settings.py</code> et crée les tables de base de données nécessaires en fonction des réglages de base de données et des migrations de base de données contenues dans l'application (nous les aborderons plus tard). Vous verrez apparaître un message pour chaque migration appliquée.
</p>
</div>
</div>

<div id="outline-container-org4a6f1ca" class="outline-3">
<h3 id="org4a6f1ca"><span class="section-number-3">5.3.</span> Examen des tables de votre base de données</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Pour afficher les tables créées par Django, si cela vous intéresse, lancez le client en ligne de commande de votre base de données. Par exemple pour SQLite:
</p>

<div class="org-src-container">
<pre class="src src-bash">sqlite3 db.sqlite3
</pre>
</div>

<p>
Puis, tapez l'une des commandes suivantes:
</p>
<ul class="org-ul">
<li><code>\dt</code> (PostgreSQL),</li>
<li><code>SHOW TABLES;</code> (MariaDB, MySQL),</li>
<li><code>.tables</code> (SQLite)</li>
<li><code>SELECT TABLE_NAME FROM USER_TABLES;</code> (Oracle)</li>
</ul>
</div>
</div>

<div id="outline-container-org2265308" class="outline-3">
<h3 id="org2265308"><span class="section-number-3">5.4.</span> Création des modèles</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-orgc6725fb" class="outline-4">
<h4 id="orgc6725fb"><span class="section-number-4">5.4.1.</span> Philosophie des modèles</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
Dans la programmation orientée objet, un champ (ou attribut) est une propriété d'un objet. Cette propriété a un nom, un type de données et une valeur.
</p>

<p>
Un <b><b>modèle</b></b> est la source d'information unique et définitive pour vos données. Il contient les <b><b>champs</b></b> essentiels et le comportement attendu des données que vous stockerez. Django respecte la philosophie DRY (Don't Repeat Yourself), ne vous répétez pas. Le but est de définir le modèle des données à un seul endroit, et ensuite de dériver automatiquement ce qui est nécessaire à partir de celui-ci.
</p>

<ul class="org-ul">
<li><b><b>Un modèle équivaut à une table SQL et chaque modèle est représenté par une classe Python</b></b> (qui hérite de <code>django.db.models.Model</code>).</li>
<li><b><b>Chaque champ correspond à une colonne dans une table SQL et chaque champ est représenté par un attribut de la classe Python correspondant au modèle.</b></b></li>
</ul>
</div>
</div>

<div id="outline-container-orgf4a847c" class="outline-4">
<h4 id="orgf4a847c"><span class="section-number-4">5.4.2.</span> Modèles dans notre application de sondage</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
Nous allons créer deux modèles : <code>Question</code> et <code>Choice</code> (choix).
</p>
<ul class="org-ul">
<li>Une Question possède deux champs : un énoncé de type <code>CharField</code> et une date de mise en ligne de type <code>DateTimeField</code>.</li>
<li>Un choix a deux champs : le texte représentant le choix et le décompte des votes. Chaque choix est associé à une Question.</li>
</ul>

<p>
Ces concepts sont représentés par des classes Python dont les attributs correspondent aux champs des modèles.
</p>

<p>
Éditez le fichier <code>polls/models.py</code> de façon à ce qu'il ressemble à ceci :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.db <span style="color: #0000FF;">import</span> models

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Question</span>(models.Model):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">question_text</span> = models.CharField(max_length=200)    <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#233;nonc&#233; de la question</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   pub_date = models.DateTimeField(<span style="color: #008000;">"date published"</span>)   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">date de publication</span>


<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Choice</span>(models.Model):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   question = models.ForeignKey(Question, on_delete=models.CASCADE)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">chaque vote (Choice) n'est reli&#233; qu'&#224; une seule Question</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   choice_text = models.CharField(max_length=200)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   votes = models.IntegerField(default=0)

</pre>
</div>


<p>
Ici, chaque modèle est représenté par une classe qui hérite de <code>django.db.models.Model</code>.
Chaque modèle possède des attributs (variables de classe).
Chaque attribut représentant un champ de la base de données pour ce modèle.
</p>

<p>
Notez que nous définissons une relation, en utilisant <code>ForeignKey</code>. Cela indique à Django que chaque vote (<code>Choice</code>) n'est relié qu'à une seule Question. Django propose tous les modèles classiques de relations : plusieurs-à-un, plusieurs-à-plusieurs, un-à-un.
</p>

<p>
Chaque autre attribut est un champ représenté par une instance d'une classe <code>Field</code> (par exemple, <code>CharField</code> pour les champs de type caractère, et <code>DateTimeField</code> pour les champs date et heure). Cela indique à Django le type de données que contient chaque champ.
</p>

<p>
Liste des champs proposés pas Django : 
<a href="https://docs.djangoproject.com/fr/5.0/ref/models/fields/#field-types">https://docs.djangoproject.com/fr/5.0/ref/models/fields/#field-types</a>
</p>

<p>
Le nom de chaque instance de <code>Field</code> (par exemple, <code>question_text</code> ou <code>pub_date</code>) est le nom du champ en interne. Vous l'utiliserez dans votre code Python et votre base de données l'utilisera comme nom de colonne.
</p>

<p>
Vous pouvez utiliser le premier paramètre de position (facultatif) d'un Field pour donner un nom plus lisible au champ. C'est utilisé par le système d'introspection de Django, et aussi pour la documentation. Si ce paramètre est absent, Django utilisera le nom du champ interne. Dans l'exemple, nous n'avons défini qu'un seul nom plus lisible, pour <code>Question.pub_date</code>. Pour tous les autres champs, nous avons considéré que le nom interne était suffisamment lisible.
</p>

<p>
Certaines classes Field possèdent des paramètres obligatoires. La classe <code>CharField</code>, par exemple, a besoin d'un attribut <code>max_length</code>. Ce n'est pas seulement utilisé dans le schéma de base de la base de données, mais également pour valider les champs, comme nous allons voir prochainement.
</p>

<p>
Un champ Field peut aussi autoriser des paramètres facultatifs ; dans notre cas, nous avons défini à 0 la valeur <code>default</code> de votes.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-orgbcb4609" class="outline-2">
<h2 id="orgbcb4609"><span class="section-number-2">6.</span> Inclure l'application au projet</h2>
<div class="outline-text-2" id="text-6">
</div>
