tutoriel.org
** Philosophie
Les applications de Django sont comme des pièces d'un jeu de construction : vous pouvez utiliser une application dans plusieurs projets, et vous pouvez distribuer les applications, parce qu'elles n'ont pas besoin d'être liées à une installation Django particulière.

** Étape 1 : créer ou modifier les modèles
Pour inclure l'application dans notre projet, nous avons besoin d'ajouter une référence à sa classe de configuration dans le réglage ~INSTALLED_APPS~.
La classe PollsConfig se trouve dans le fichier ~polls/apps.py~, ce qui signifie que son chemin pointé est ~polls.apps.PollsConfig~.

Modifiez le fichier ~mysite/settings.py~ et ajoutez ce chemin pointé au réglage ~INSTALLED_APPS~. Il doit ressembler à ceci :

#+begin_src python name="mysite/settings.py" :exports code
INSTALLED_APPS = [
    "polls.apps.PollsConfig", # ajout d'une référence
    "django.contrib.admin",
    "django.contrib.auth",
    "django.contrib.contenttypes",
    "django.contrib.sessions",
    "django.contrib.messages",
    "django.contrib.staticfiles",
]
#+end_src

Maintenant, Django sait qu'il doit inclure l'application polls.

** Étape 2 : créer des migrations correspondant à ces changements

Exécutons une autre commande :

#+begin_src bash :exports code
$ python manage.py makemigrations polls
#+end_src

En exécutant ~makemigrations~, vous indiquez à Django que vous avez effectué des changements à vos modèles (dans notre cas, nous avons créé deux modèles) et que vous aimeriez que ces changements soient stockés sous forme de migration.

Vous pouvez consulter la migration pour vos nouveaux modèles si vous le voulez ; il s'agit du fichier ~polls/migrations/0001_initial.py~. Vous n'êtes pas censé les lire chaque fois que Django en crée, mais ils sont conçus pour être humainement lisibles.

Les migrations sont très puissantes et permettent de gérer les changements de modèles dans le temps, au cours du développement d'un projet, sans devoir supprimer la base de données ou ses tables et en refaire de nouvelles. Une migration s'attache à mettre à jour la base de données en live, sans perte de données.

Si cela vous intéresse, vous pouvez exécuter ~python manage.py check~ ; cette commande vérifie la conformité de votre projet sans appliquer de migration et sans toucher à la base de données.

** Étape 3 : appliquer ces modifications à la base de données 

Maintenant, exécutez à nouveau la commande ~migrate~ pour créer les tables des modèles dans votre base de données :

#+begin_src bash
$ python manage.py migrate
#+end_src

- Des clés primaires (ID) sont ajoutées automatiquement.
- Django ajoute ~_id~ au nom de champ des clés étrangères.


* L'interface de programmation (API)

Maintenant, utilisons un **shell interactif Python** pour bénéficier de l'API que Django met gratuitement à notre disposition.

Pour lancer un shell Python, utilisez cette commande :
#+begin_src bash
$ python manage.py shell
#+end_src

** Importer les modèles d'une application

#+begin_src python :exports code
# Importe les modèles de l'application polls
>>> from polls.models import Choice, Question  
#+end_src

** Lister tous les objets (instances d'une classe de modèle)

Pour lister tous les enregistrements:
#+begin_src python :exports code
>>> Question.objects.all()
#+end_src

#+begin_src python :exports code
>>> Choice.objects.all()
#+end_src

** Créer de nouveaux objets
*** Créer une nouvelle question

Un objet ~question~ a deux attributs: ~question_text~ et  ~pub_date~

La prise en charge des fuseaux horaires (timezone) est activée dans le fichier de paramètres par défaut, donc Django attend:

#+begin_src python :exports code
>>> from django.utils import timezone
>>> q = Question(question_text="Quoi de neuf ?",
                 pub_date=timezone.now())
#+end_src

*** Sauvegarder une question dans la base de données

Vous devez appeler ~save()~ explicitement.

#+begin_src python :exports code
>>> q.save()
#+end_src

Maintenant la question à un ID.

#+begin_src python :exports code
>>> q.id
#+end_src

*** Ajouter des méthodes ~__str__()~ aux modèles
Il est important d'ajouter des méthodes ~__str__()~ à vos modèles, non seulement parce que c'est plus pratique lorsque vous utilisez le shell interactif, mais aussi parce que la représentation des objets est très utilisée dans l'interface d'administration automatique de Django.

#+begin_src python :exports code name="polls/models.py"
from django.db import models

class Question(models.Model):
    # ...
    def __str__(self):
        return self.question_text

class Choice(models.Model):
    # ...
    def __str__(self):
        return self.choice_text
#+end_src

Dorénavant, lister les objets transmettra une liste des textes qui avaient été saisis. 

#+begin_src python :exports code
>>> Question.objects.all()
#+end_src

#+begin_src fundamental
<QuerySet [<Question: Quoi de neuf?>]>
#+end_src

