tutoriel.html
<div id="outline-container-org1e5109c" class="outline-3">
<h3 id="org1e5109c"><span class="section-number-3">6.1.</span> Philosophie</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Les applications de Django sont comme des pièces d'un jeu de construction : vous pouvez utiliser une application dans plusieurs projets, et vous pouvez distribuer les applications, parce qu'elles n'ont pas besoin d'être liées à une installation Django particulière.
</p>
</div>
</div>

<div id="outline-container-org8b26573" class="outline-3">
<h3 id="org8b26573"><span class="section-number-3">6.2.</span> Étape 1 : créer ou modifier les modèles</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Pour inclure l'application dans notre projet, nous avons besoin d'ajouter une référence à sa classe de configuration dans le réglage <code>INSTALLED_APPS</code>.
La classe PollsConfig se trouve dans le fichier <code>polls/apps.py</code>, ce qui signifie que son chemin pointé est <code>polls.apps.PollsConfig</code>.
</p>

<p>
Modifiez le fichier <code>mysite/settings.py</code> et ajoutez ce chemin pointé au réglage <code>INSTALLED_APPS</code>. Il doit ressembler à ceci :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #BA36A5;">INSTALLED_APPS</span> = [
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"polls.apps.PollsConfig"</span>, <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ajout d'une r&#233;f&#233;rence</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.admin"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.auth"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.contenttypes"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.sessions"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.messages"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"django.contrib.staticfiles"</span>,
]
</pre>
</div>

<p>
Maintenant, Django sait qu'il doit inclure l'application polls.
</p>
</div>
</div>

<div id="outline-container-orgcc0830e" class="outline-3">
<h3 id="orgcc0830e"><span class="section-number-3">6.3.</span> Étape 2 : créer des migrations correspondant à ces changements</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Exécutons une autre commande :
</p>

<div class="org-src-container">
<pre class="src src-bash">$ python manage.py makemigrations polls
</pre>
</div>

<p>
En exécutant <code>makemigrations</code>, vous indiquez à Django que vous avez effectué des changements à vos modèles (dans notre cas, nous avons créé deux modèles) et que vous aimeriez que ces changements soient stockés sous forme de migration.
</p>

<p>
Vous pouvez consulter la migration pour vos nouveaux modèles si vous le voulez ; il s'agit du fichier <code>polls/migrations/0001_initial.py</code>. Vous n'êtes pas censé les lire chaque fois que Django en crée, mais ils sont conçus pour être humainement lisibles.
</p>

<p>
Les migrations sont très puissantes et permettent de gérer les changements de modèles dans le temps, au cours du développement d'un projet, sans devoir supprimer la base de données ou ses tables et en refaire de nouvelles. Une migration s'attache à mettre à jour la base de données en live, sans perte de données.
</p>

<p>
Si cela vous intéresse, vous pouvez exécuter <code>python manage.py check</code> ; cette commande vérifie la conformité de votre projet sans appliquer de migration et sans toucher à la base de données.
</p>
</div>
</div>

<div id="outline-container-orgd0ef6bb" class="outline-3">
<h3 id="orgd0ef6bb"><span class="section-number-3">6.4.</span> Étape 3 : appliquer ces modifications à la base de données</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Maintenant, exécutez à nouveau la commande <code>migrate</code> pour créer les tables des modèles dans votre base de données :
</p>

<div class="org-src-container">
<pre class="src src-bash">$ python manage.py migrate
</pre>
</div>

<ul class="org-ul">
<li>Des clés primaires (ID) sont ajoutées automatiquement.</li>
<li>Django ajoute <code>_id</code> au nom de champ des clés étrangères.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org326c325" class="outline-2">
<h2 id="org326c325"><span class="section-number-2">7.</span> L'interface de programmation (API)</h2>
<div class="outline-text-2" id="text-7">
<p>
Maintenant, utilisons un <b><b>shell interactif Python</b></b> pour bénéficier de l'API que Django met gratuitement à notre disposition.
</p>

<p>
Pour lancer un shell Python, utilisez cette commande :
</p>
<div class="org-src-container">
<pre class="src src-bash">$ python manage.py shell
</pre>
</div>
</div>

<div id="outline-container-org5c2323c" class="outline-3">
<h3 id="org5c2323c"><span class="section-number-3">7.1.</span> Importer les modèles d'une application</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Importe les mod&#232;les de l'application polls</span>
&gt;&gt;&gt; <span style="color: #0000FF;">from</span> polls.models <span style="color: #0000FF;">import</span> Choice, Question  
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaeb13ec" class="outline-3">
<h3 id="orgaeb13ec"><span class="section-number-3">7.2.</span> Lister tous les objets (instances d'une classe de modèle)</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Pour lister tous les enregistrements:
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.<span style="color: #006FE0;">all</span>()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Choice.objects.<span style="color: #006FE0;">all</span>()
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ca7db7" class="outline-3">
<h3 id="org4ca7db7"><span class="section-number-3">7.3.</span> Créer de nouveaux objets</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-org44faaa7" class="outline-4">
<h4 id="org44faaa7"><span class="section-number-4">7.3.1.</span> Créer une nouvelle question</h4>
<div class="outline-text-4" id="text-7-3-1">
<p>
Un objet <code>question</code> a deux attributs: <code>question_text</code> et  <code>pub_date</code>
</p>

<p>
La prise en charge des fuseaux horaires (timezone) est activée dans le fichier de paramètres par défaut, donc Django attend:
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #0000FF;">from</span> django.utils <span style="color: #0000FF;">import</span> timezone
&gt;&gt;&gt; <span style="color: #BA36A5;">q</span> = Question(question_text=<span style="color: #008000;">"Quoi de neuf ?"</span>,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>pub_date=timezone.now())
</pre>
</div>
</div>
</div>

<div id="outline-container-org228bf99" class="outline-4">
<h4 id="org228bf99"><span class="section-number-4">7.3.2.</span> Sauvegarder une question dans la base de données</h4>
<div class="outline-text-4" id="text-7-3-2">
<p>
Vous devez appeler <code>save()</code> explicitement.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.save()
</pre>
</div>

<p>
Maintenant la question à un ID.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.<span style="color: #006FE0;">id</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org06186e1" class="outline-4">
<h4 id="org06186e1"><span class="section-number-4">7.3.3.</span> Ajouter des méthodes <code>__str__()</code> aux modèles</h4>
<div class="outline-text-4" id="text-7-3-3">
<p>
Il est important d'ajouter des méthodes <code>__str__()</code> à vos modèles, non seulement parce que c'est plus pratique lorsque vous utilisez le shell interactif, mais aussi parce que la représentation des objets est très utilisée dans l'interface d'administration automatique de Django.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.db <span style="color: #0000FF;">import</span> models

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Question</span>(models.Model):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">...</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">__str__</span>(<span style="color: #0000FF;">self</span>):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">self</span>.question_text

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Choice</span>(models.Model):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">...</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">__str__</span>(<span style="color: #0000FF;">self</span>):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">self</span>.choice_text
</pre>
</div>

<p>
Dorénavant, lister les objets transmettra une liste des textes qui avaient été saisis. 
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.<span style="color: #006FE0;">all</span>()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet [&lt;Question: Quoi de neuf?&gt;]&gt;
</pre>
</div>
</div>
</div>
