tutoriel.org
*** Ajouter une méthode à un modèle

#+begin_src python :exports code name="polls/models.py"
import datetime

from django.db import models
from django.utils import timezone


class Question(models.Model):
    # ...
    def was_published_recently(self): # publié il y a moins d'un jour
        return self.pub_date >= timezone.now() - datetime.timedelta(days=1)

#+end_src

*** Afficher les choix associés à une question

Sélectionnez une question :

#+begin_src python :exports code
>>> q = Question.objects.get(pk=1)
#+end_src

Afficher tous les choix associés à cette question donc aucun jusqu'à présent :

#+begin_src python :exports code
>>> q.choice_set.all()
#+end_src

#+begin_src fundamental
<QuerySet []>
#+end_src

*** Créer de nouveaux choix associés à une question

Donnons quelques choix à cette question.

L'appel ~create~ construit un nouvel objet ~Choice~, exécute l'instruction ~INSERT~, ajoute le choix à l'ensemble de choix disponibles et renvoie le nouvel objet de type ~Choice~.

Django crée un ensemble (défini comme ~choice_set~) pour contenir "l'autre côté" d'une relation clé étrangère (par exemple le choix d'une question) accessible via l'API.

Créez trois choix:
#+begin_src python :exports code
>>> q.choice_set.create(choice_text="Not much", votes=0)
#+end_src

#+begin_src fundamental
<Choice: Not much>
#+end_src

#+begin_src python :exports code
>>> q.choice_set.create(choice_text="The sky", votes=0)
#+end_src

#+begin_src fundamental
<Choice: The sky>
#+end_src

#+begin_src python :exports code
>>> c = q.choice_set.create(choice_text="Just hacking again", votes=0)
#+end_src

*** Relations

Les objets de type Choice ont un accès API à l'objet de type Question qui leur est associé.

#+begin_src python :exports code
>>> c.question
#+end_src

#+begin_src fundamental
<Question: Quoi de neuf?>
#+end_src


Et vice versa, les objets de type ~Question~ ont accès aux objets de type ~Choice~ :

#+begin_src python :exports code
>>> q.choice_set.all()
#+end_src

#+begin_src fundamental
<QuerySet [<Choice: Not much>, <Choice: The sky>, <Choice: Just hacking again>]>
#+end_src


#+begin_src python :exports code
>>> q.choice_set.count()
#+end_src

#+begin_src fundamental
3
#+end_src


** Filtrer

*** Filtrer les enregistrements par valeur de champ
#+begin_src python :exports code
>>> Question.objects.filter(id=1)
#+end_src

#+begin_src fundamental
<QuerySet [<Question: Quoi de neuf?>]>
#+end_src

#+begin_src python :exports code
>>> Question.objects.filter(question_text__startswith="Quoi")
#+end_src

#+begin_src fundamental
<QuerySet [<Question: Quoi de neuf?>]>
#+end_src

La méthode ~filter()~ renvoie un objet queryset.

Si vous utilisez ~filter()~, vous le faites généralement chaque fois que vous attendez plus d'un objet correspondant à vos critères.

Si aucun élément ne correspond à vos critères, ~filter()~ renvoie un ensemble de requêtes vide sans générer d'erreur.

#+begin_src fundamental
<QuerySet []>
#+end_src

*** Filtrer les choix

L'API suit automatiquement les relations autant que vous en avez besoin.
Utilisez des traits de soulignement doubles pour séparer les relations.
Cela fonctionne à autant de niveaux que vous le souhaitez ; il n'y a pas de limite.

Trouvez tous les choix pour toute question dont la date_pub est cette année (en réutilisant la variable ~current_year~ que nous avons créée ci-dessus) :

#+begin_src  python
>>> Choice.objects.filter(question__pub_date__year=current_year)
#+end_src

#+begin_src fundamental
<QuerySet [<Choice: Not much>, <Choice: The sky>, <Choice: Just hacking again>]>
#+end_src

*** Filtrer puis supprimer

Supprimons l'un des choix. Utilisez ~delete()~ pour cela :

#+begin_src python :exports code
>>> c = q.choice_set.filter(choice_text__startswith="Just hacking")
>>> c.delete()
#+end_src

** Obtenir un objet
Si vous utilisez ~get()~, vous attendez un (et un seul) élément correspondant à vos critères.

#+begin_src python :exports code
# Obtenez la question qui a été publiée cette année.
>>> from django.utils import timezone
>>> current_year = timezone.now().year
>>> Question.objects.get(pub_date__year=current_year)
#+end_src

#+begin_src fundamental
<Question: Quoi de neuf?>
#+end_src

La méthode ~get()~ renvoie une erreur si l'élément n'existe pas ou s'il existe plusieurs éléments correspondant à vos critères.


#+begin_src python :exports code
>>> Question.objects.get(id=2)
#+end_src

#+begin_src fundamental
Traceback (most recent call last):
    ...
DoesNotExist: Question matching query does not exist.
#+end_src

Vous devez donc toujours utiliser ~if~ dans un bloc ~try.. except ..~ ou avec une fonction de raccourci comme ~get_object_or_404~ afin de gérer correctement les exceptions.

