tutoriel.html

<div id="outline-container-org17720b4" class="outline-4">
<h4 id="org17720b4"><span class="section-number-4">7.3.4.</span> Ajouter une méthode à un modèle</h4>
<div class="outline-text-4" id="text-7-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">import</span> datetime

<span style="color: #0000FF;">from</span> django.db <span style="color: #0000FF;">import</span> models
<span style="color: #0000FF;">from</span> django.utils <span style="color: #0000FF;">import</span> timezone


<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Question</span>(models.Model):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">...</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">was_published_recently</span>(<span style="color: #0000FF;">self</span>): <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">publi&#233; il y a moins d'un jour</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">self</span>.pub_date &gt;= timezone.now() - datetime.timedelta(days=1)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd80938c" class="outline-4">
<h4 id="orgd80938c"><span class="section-number-4">7.3.5.</span> Afficher les choix associés à une question</h4>
<div class="outline-text-4" id="text-7-3-5">
<p>
Sélectionnez une question :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #BA36A5;">q</span> = Question.objects.get(pk=1)
</pre>
</div>

<p>
Afficher tous les choix associés à cette question donc aucun jusqu'à présent :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.choice_set.<span style="color: #006FE0;">all</span>()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet []&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb89bc7e" class="outline-4">
<h4 id="orgb89bc7e"><span class="section-number-4">7.3.6.</span> Créer de nouveaux choix associés à une question</h4>
<div class="outline-text-4" id="text-7-3-6">
<p>
Donnons quelques choix à cette question.
</p>

<p>
L'appel <code>create</code> construit un nouvel objet <code>Choice</code>, exécute l'instruction <code>INSERT</code>, ajoute le choix à l'ensemble de choix disponibles et renvoie le nouvel objet de type <code>Choice</code>.
</p>

<p>
Django crée un ensemble (défini comme <code>choice_set</code>) pour contenir "l'autre côté" d'une relation clé étrangère (par exemple le choix d'une question) accessible via l'API.
</p>

<p>
Créez trois choix:
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.choice_set.create(choice_text=<span style="color: #008000;">"Not much"</span>, votes=0)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;Choice: Not much&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.choice_set.create(choice_text=<span style="color: #008000;">"The sky"</span>, votes=0)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;Choice: The sky&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #BA36A5;">c</span> = q.choice_set.create(choice_text=<span style="color: #008000;">"Just hacking again"</span>, votes=0)
</pre>
</div>
</div>
</div>

<div id="outline-container-org908e7ec" class="outline-4">
<h4 id="org908e7ec"><span class="section-number-4">7.3.7.</span> Relations</h4>
<div class="outline-text-4" id="text-7-3-7">
<p>
Les objets de type Choice ont un accès API à l'objet de type Question qui leur est associé.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; c.question
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;Question: Quoi de neuf?&gt;
</pre>
</div>


<p>
Et vice versa, les objets de type <code>Question</code> ont accès aux objets de type <code>Choice</code> :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.choice_set.<span style="color: #006FE0;">all</span>()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet [&lt;Choice: Not much&gt;, &lt;Choice: The sky&gt;, &lt;Choice: Just hacking again&gt;]&gt;
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; q.choice_set.count()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">3
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org20cd1fc" class="outline-3">
<h3 id="org20cd1fc"><span class="section-number-3">7.4.</span> Filtrer</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-org9afb9d7" class="outline-4">
<h4 id="org9afb9d7"><span class="section-number-4">7.4.1.</span> Filtrer les enregistrements par valeur de champ</h4>
<div class="outline-text-4" id="text-7-4-1">
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.<span style="color: #006FE0;">filter</span>(<span style="color: #006FE0;">id</span>=1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet [&lt;Question: Quoi de neuf?&gt;]&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.<span style="color: #006FE0;">filter</span>(question_text__startswith=<span style="color: #008000;">"Quoi"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet [&lt;Question: Quoi de neuf?&gt;]&gt;
</pre>
</div>

<p>
La méthode <code>filter()</code> renvoie un objet queryset.
</p>

<p>
Si vous utilisez <code>filter()</code>, vous le faites généralement chaque fois que vous attendez plus d'un objet correspondant à vos critères.
</p>

<p>
Si aucun élément ne correspond à vos critères, <code>filter()</code> renvoie un ensemble de requêtes vide sans générer d'erreur.
</p>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet []&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8038746" class="outline-4">
<h4 id="org8038746"><span class="section-number-4">7.4.2.</span> Filtrer les choix</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
L'API suit automatiquement les relations autant que vous en avez besoin.
Utilisez des traits de soulignement doubles pour séparer les relations.
Cela fonctionne à autant de niveaux que vous le souhaitez ; il n'y a pas de limite.
</p>

<p>
Trouvez tous les choix pour toute question dont la date<sub>pub</sub> est cette année (en réutilisant la variable <code>current_year</code> que nous avons créée ci-dessus) :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Choice.objects.<span style="color: #006FE0;">filter</span>(question__pub_date__year=current_year)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;QuerySet [&lt;Choice: Not much&gt;, &lt;Choice: The sky&gt;, &lt;Choice: Just hacking again&gt;]&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3a59a2" class="outline-4">
<h4 id="orgb3a59a2"><span class="section-number-4">7.4.3.</span> Filtrer puis supprimer</h4>
<div class="outline-text-4" id="text-7-4-3">
<p>
Supprimons l'un des choix. Utilisez <code>delete()</code> pour cela :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #BA36A5;">c</span> = q.choice_set.<span style="color: #006FE0;">filter</span>(choice_text__startswith=<span style="color: #008000;">"Just hacking"</span>)
&gt;&gt;&gt; c.delete()
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb4043a9" class="outline-3">
<h3 id="orgb4043a9"><span class="section-number-3">7.5.</span> Obtenir un objet</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Si vous utilisez <code>get()</code>, vous attendez un (et un seul) élément correspondant à vos critères.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Obtenez la question qui a &#233;t&#233; publi&#233;e cette ann&#233;e.</span>
&gt;&gt;&gt; <span style="color: #0000FF;">from</span> django.utils <span style="color: #0000FF;">import</span> timezone
&gt;&gt;&gt; <span style="color: #BA36A5;">current_year</span> = timezone.now().year
&gt;&gt;&gt; Question.objects.get(pub_date__year=current_year)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;Question: Quoi de neuf?&gt;
</pre>
</div>

<p>
La méthode <code>get()</code> renvoie une erreur si l'élément n'existe pas ou s'il existe plusieurs éléments correspondant à vos critères.
</p>


<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.get(<span style="color: #006FE0;">id</span>=2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">Traceback (most recent call last):
    ...
DoesNotExist: Question matching query does not exist.
</pre>
</div>

<p>
Vous devez donc toujours utiliser <code>if</code> dans un bloc <code>try.. except ..</code> ou avec une fonction de raccourci comme <code>get_object_or_404</code> afin de gérer correctement les exceptions.
</p>
</div>
</div>
