tutoriel.org
** Raccourci pour obtenir un objet par clé primaire
La recherche par clé primaire est le cas le plus courant, donc   Django fournit un raccourci pour les recherches exactes par clé primaire.

Ce qui suit est identique à ~Question.objects.get(id=1)~.

#+begin_src python :exports code
>>> Question.objects.get(pk=1)
#+end_src

#+begin_src  fundamental
<Question: Quoi de neuf?>
#+end_src

Assurez-vous que notre méthode personnalisée a fonctionné :

#+begin_src python :exports code
>>> q = Question.objects.get(pk=1)
>>> q.was_published_recently()
#+end_src

#+begin_src fundamental
True
#+end_src




* Introduction au site d'administration de Django

** Philosophie

L'interface d'administration n'est pas destinée à être utilisée par les visiteurs du site ; elle est conçue pour les administrateurs c'est-à-dire les gestionnaires du site qui éditent le contenu pour ajouter des nouvelles, des histoires, des événements, des résultats sportifs, etc.

Django procure une interface uniforme pour les administrateurs du site. 

Django a été écrit dans un environnement éditorial, avec une très nette séparation entre les *éditeurs de contenu* et le site *public* publié à destination des visiteurs.

** Création d'un utilisateur administrateur

Pour créer un compte administrateur, utilisez la commande suivante :

#+begin_src python :exports code
$ python manage.py createsuperuser
#+end_src


** Démarrage du serveur de développement

Le site d'administration de Django est activé par défaut.

Si le serveur ne tourne pas encore, démarrez-le comme ceci :

#+begin_src python :exportscode
$ python manage.py runserver
#+end_src


À présent, ouvrez un navigateur Web et allez à l'URL « /admin/ » de votre domaine local – par exemple, http://127.0.0.1:8000/admin/. Vous devriez voir l'écran de connexion à l'interface d'administration.

Comme la traduction est active par défaut, si vous définissez ~LANGUAGE_CODE~ dans ~settings.py~, l'écran de connexion s'affiche dans cette langue (pour autant que les traductions correspondantes existent dans Django).

** Rendre l'application de sondage modifiable via l'interface d'admin

Il faut indiquer à l'admin que les objets ~Question~ ont une interface d'administration. Pour ceci, ouvrez le fichier
~polls/admin.py~ et éditez-le de la manière suivante :

#+begin_src python :exports code name='polls/admin.py'
from django.contrib import admin
from .models import Question
admin.site.register(Question)
#+end_src

Maintenant les sondages apparaissent sur la Page d'accueil du site d'administration de Django.

Cliquez sur la question « Quoi de neuf ? » pour la modifier à travers le formulaire d'édition de l'objet question lequel est généré automatiquement à partir du modèle Question. Les différents types de champs du modèle (DateTimeField, CharField) correspondent au composant graphique d'entrée HTML approprié. Chaque type de champ sait comment s'afficher dans l'interface d'administration de Django.


Si la valeur de ~Date de publication~ ne correspond pas à l'heure à laquelle vous avez créé cette question vous avez probablement oublié de définir la valeur correcte du paramètre ~TIME_ZONE~. Modifiez-le, rechargez la page et vérifiez que la bonne valeur s'affiche.

Si vous cliquez sur ~Historique~ en haut à droite de la page, vous verrez une page listant toutes les modifications effectuées sur cet objet via l'interface d'administration de Django, accompagnées des date et heure, ainsi que du nom de l'utilisateur qui a fait ce changement.




* Création de l'interface publique (les vues)
** Aperçu

- Dans Django, les pages Web et les autres contenus sont générés par des vues.
- Chaque vue est représentée par une fonction Python (ou une méthode dans le cas des vues basées sur des classes).
- Django choisit une vue en examinant l'URL demandée (pour être précis, la partie de l'URL après le nom de domaine).

Dans notre application de sondage, nous aurons les quatre vues suivantes :

- La page de sommaire des questions : affiche quelques-unes des dernières questions.
- La page de détail d'une question : affiche le texte d'une question, sans les résultats mais avec un formulaire pour voter.
- La page des résultats d'une question : affiche les résultats d'une question particulière.
- Action de vote : gère le vote pour un choix particulier dans une question précise.

Un modèle (motif) d'URL est la forme générale d'une URL ; par exemple : ~/archive/<année>/<mois>/~. Pour passer de l'URL à la vue, Django utilise ce qu'on appelle des configurations d'URL (~URLconf~). Une configuration d'URL associe des motifs d'URL à des vues.

** Écriture de vues supplémentaires
  

#+begin_src python :exports code
from django.http import HttpResponse

# Première vue

def index(request):
    return HttpResponse("Hello, world. You're at the polls index.")

# Autres vues:

def detail(request, question_id):
    return HttpResponse(f"You're looking at question {question_id}")

def results(request, question_id):
    response = f"You're looking at the results of question {question_id}."
    return HttpResponse(response)

def vote(request, question_id):
    return HttpResponse(f"You're voting on question {question_id}.")


#+end_src

Nous avions parlé de la  première vue qui est la vue la plus basique possible dans Django.
Les autres vues acceptent un paramètre.

