tutoriel.html

<div id="outline-container-org100ff1f" class="outline-3">
<h3 id="org100ff1f"><span class="section-number-3">7.6.</span> Raccourci pour obtenir un objet par clé primaire</h3>
<div class="outline-text-3" id="text-7-6">
<p>
La recherche par clé primaire est le cas le plus courant, donc   Django fournit un raccourci pour les recherches exactes par clé primaire.
</p>

<p>
Ce qui suit est identique à <code>Question.objects.get(id=1)</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Question.objects.get(pk=1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">&lt;Question: Quoi de neuf?&gt;
</pre>
</div>

<p>
Assurez-vous que notre méthode personnalisée a fonctionné :
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="color: #BA36A5;">q</span> = Question.objects.get(pk=1)
&gt;&gt;&gt; q.was_published_recently()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-fundamental">True
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org7343e30" class="outline-2">
<h2 id="org7343e30"><span class="section-number-2">8.</span> Introduction au site d'administration de Django</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgd188d83" class="outline-3">
<h3 id="orgd188d83"><span class="section-number-3">8.1.</span> Philosophie</h3>
<div class="outline-text-3" id="text-8-1">
<p>
L'interface d'administration n'est pas destinée à être utilisée par les visiteurs du site ; elle est conçue pour les administrateurs c'est-à-dire les gestionnaires du site qui éditent le contenu pour ajouter des nouvelles, des histoires, des événements, des résultats sportifs, etc.
</p>

<p>
Django procure une interface uniforme pour les administrateurs du site. 
</p>

<p>
Django a été écrit dans un environnement éditorial, avec une très nette séparation entre les <b>éditeurs de contenu</b> et le site <b>public</b> publié à destination des visiteurs.
</p>
</div>
</div>

<div id="outline-container-orgbc43792" class="outline-3">
<h3 id="orgbc43792"><span class="section-number-3">8.2.</span> Création d'un utilisateur administrateur</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Pour créer un compte administrateur, utilisez la commande suivante :
</p>

<div class="org-src-container">
<pre class="src src-python">$ python manage.py createsuperuser
</pre>
</div>
</div>
</div>


<div id="outline-container-org6648f1e" class="outline-3">
<h3 id="org6648f1e"><span class="section-number-3">8.3.</span> Démarrage du serveur de développement</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Le site d'administration de Django est activé par défaut.
</p>

<p>
Si le serveur ne tourne pas encore, démarrez-le comme ceci :
</p>

<div class="org-src-container">
<pre class="src src-python">$ python manage.py runserver
</pre>
</div>


<p>
À présent, ouvrez un navigateur Web et allez à l'URL « <i>admin</i> » de votre domaine local – par exemple, <a href="http://127.0.0.1:8000/admin/">http://127.0.0.1:8000/admin/</a>. Vous devriez voir l'écran de connexion à l'interface d'administration.
</p>

<p>
Comme la traduction est active par défaut, si vous définissez <code>LANGUAGE_CODE</code> dans <code>settings.py</code>, l'écran de connexion s'affiche dans cette langue (pour autant que les traductions correspondantes existent dans Django).
</p>
</div>
</div>

<div id="outline-container-orge406eee" class="outline-3">
<h3 id="orge406eee"><span class="section-number-3">8.4.</span> Rendre l'application de sondage modifiable via l'interface d'admin</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Il faut indiquer à l'admin que les objets <code>Question</code> ont une interface d'administration. Pour ceci, ouvrez le fichier
<code>polls/admin.py</code> et éditez-le de la manière suivante :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.contrib <span style="color: #0000FF;">import</span> admin
<span style="color: #0000FF;">from</span> .models <span style="color: #0000FF;">import</span> Question
admin.site.register(Question)
</pre>
</div>

<p>
Maintenant les sondages apparaissent sur la Page d'accueil du site d'administration de Django.
</p>

<p>
Cliquez sur la question « Quoi de neuf ? » pour la modifier à travers le formulaire d'édition de l'objet question lequel est généré automatiquement à partir du modèle Question. Les différents types de champs du modèle (DateTimeField, CharField) correspondent au composant graphique d'entrée HTML approprié. Chaque type de champ sait comment s'afficher dans l'interface d'administration de Django.
</p>


<p>
Si la valeur de <code>Date de publication</code> ne correspond pas à l'heure à laquelle vous avez créé cette question vous avez probablement oublié de définir la valeur correcte du paramètre <code>TIME_ZONE</code>. Modifiez-le, rechargez la page et vérifiez que la bonne valeur s'affiche.
</p>

<p>
Si vous cliquez sur <code>Historique</code> en haut à droite de la page, vous verrez une page listant toutes les modifications effectuées sur cet objet via l'interface d'administration de Django, accompagnées des date et heure, ainsi que du nom de l'utilisateur qui a fait ce changement.
</p>
</div>
</div>
</div>




<div id="outline-container-org11b3497" class="outline-2">
<h2 id="org11b3497"><span class="section-number-2">9.</span> Création de l'interface publique (les vues)</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org02a0a52" class="outline-3">
<h3 id="org02a0a52"><span class="section-number-3">9.1.</span> Aperçu</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Dans Django, les pages Web et les autres contenus sont générés par des vues.</li>
<li>Chaque vue est représentée par une fonction Python (ou une méthode dans le cas des vues basées sur des classes).</li>
<li>Django choisit une vue en examinant l'URL demandée (pour être précis, la partie de l'URL après le nom de domaine).</li>
</ul>

<p>
Dans notre application de sondage, nous aurons les quatre vues suivantes :
</p>

<ul class="org-ul">
<li>La page de sommaire des questions : affiche quelques-unes des dernières questions.</li>
<li>La page de détail d'une question : affiche le texte d'une question, sans les résultats mais avec un formulaire pour voter.</li>
<li>La page des résultats d'une question : affiche les résultats d'une question particulière.</li>
<li>Action de vote : gère le vote pour un choix particulier dans une question précise.</li>
</ul>

<p>
Un modèle (motif) d'URL est la forme générale d'une URL ; par exemple : <code>/archive/&lt;année&gt;/&lt;mois&gt;/</code>. Pour passer de l'URL à la vue, Django utilise ce qu'on appelle des configurations d'URL (<code>URLconf</code>). Une configuration d'URL associe des motifs d'URL à des vues.
</p>
</div>
</div>

<div id="outline-container-org0a25c83" class="outline-3">
<h3 id="org0a25c83"><span class="section-number-3">9.2.</span> Écriture de vues supplémentaires</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.http <span style="color: #0000FF;">import</span> HttpResponse

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Premi&#232;re vue</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">index</span>(request):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(<span style="color: #008000;">"Hello, world. You're at the polls index."</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Autres vues:</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">detail</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(f<span style="color: #008000;">"You're looking at question </span>{question_id}<span style="color: #008000;">"</span>)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">results</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   response = f<span style="color: #008000;">"You're looking at the results of question </span>{question_id}<span style="color: #008000;">."</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(response)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">vote</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(f<span style="color: #008000;">"You're voting on question </span>{question_id}<span style="color: #008000;">."</span>)


</pre>
</div>

<p>
Nous avions parlé de la  première vue qui est la vue la plus basique possible dans Django.
Les autres vues acceptent un paramètre.
</p>
</div>
</div>
