tutoriel.org
** Transmission de paramètres aux vues

#+begin_src python name='polls/urls.py' :exports code
from django.urls import path

from . import views

urlpatterns = [
    # ex: /polls/
    path("", views.index, name="index"), # ou views.index appelle la fonction index(request)
                                         # définie dans le fichier views.py de l'application
    # ex: /polls/5/
    path("<int:question_id>/", views.detail, name="detail"),
    # ex: /polls/5/results/
    path("<int:question_id>/results/", views.results, name="results"),
    # ex: /polls/5/vote/
    path("<int:question_id>/vote/", views.vote, name="vote"),
]
#+end_src

Ouvrez votre navigateur à l'adresse ~/polls/34/~. La fonction ~detail()~ sera exécutée et affichera l'ID fourni dans l'URL. Essayez aussi ~/polls/34/results/~ et ~/polls/34/vote/~, elles afficheront les pages modèles de résultats et de votes.

Lorsque quelqu'un demande une page de votre site Web, par exemple ~/polls/34/~, Django charge le module Python ~mysite.urls~ parce qu'il est mentionné dans le réglage ~ROOT_URLCONF~. Il trouve la variable nommée ~urlpatterns~ et parcourt les motifs dans l'ordre. Après avoir trouvé la correspondance ~polls/~, il retire le texte correspondant ("polls/") et passe le texte restant – "34/" – à la configuration d'URL “polls.urls” pour la suite du traitement. Là, c'est ~<int:question_id>/~ qui correspond ce qui aboutit à un appel à la vue ~detail()~ comme ceci :

#+begin_src python :exports code
detail(request=<HttpRequest object>, question_id=34)
#+end_src

La partie ~question_id=34~ vient de ~<int:question_id>~. En utilisant des chevrons, cela capture une partie de l'URL l'envoie en tant que paramètre nommé à la fonction de vue ; la partie ~question_id~ de la chaîne définit le nom qui va être utilisé pour identifier le motif trouvé, et la partie ~int~ est un convertisseur qui détermine ce à quoi les motifs doivent correspondre dans cette partie du chemin d'URL. Le caractère deux-points (:) sépare le convertisseur du nom de la partie capturée.

** Écriture de vues qui font réellement des choses

Chaque vue est responsable de faire une des deux choses suivantes : retourner un objet HttpResponse contenant le contenu de la page demandée, ou lever une exception, comme par exemple Http404. Le reste, c'est votre travail.

Votre vue peut lire des entrées depuis une base de données, ou pas. Elle peut utiliser un système de gabarits comme celui de Django – ou un système de gabarits tiers – ou pas. Elle peut générer un fichier PDF, produire de l'XML, créer un fichier ZIP à la volée, tout ce que vous voulez, en utilisant les bibliothèques Python que vous voulez.

*** Codage en dur sans gabarit

L'allure de la page est codée en dur dans la vue.

#+begin_src python :exports code name='polls/views.py'
def latestQuestions(request):
    latest_question_list = Question.objects.order_by("-pub_date")[:5]
    output = ", ".join([q.question_text for q in latest_question_list])
    return HttpResponse(output)
#+end_src

