tutoriel.html

<div id="outline-container-org476a970" class="outline-3">
<h3 id="org476a970"><span class="section-number-3">9.3.</span> Transmission de paramètres aux vues</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.urls <span style="color: #0000FF;">import</span> path

<span style="color: #0000FF;">from</span> . <span style="color: #0000FF;">import</span> views

<span style="color: #BA36A5;">urlpatterns</span> = [
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ex: /polls/</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">""</span>, views.index, name=<span style="color: #008000;">"index"</span>), <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ou views.index appelle la fonction index(request)</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">d&#233;finie dans le fichier views.py de l'application</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ex: /polls/5/</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:question_id&gt;/"</span>, views.detail, name=<span style="color: #008000;">"detail"</span>),
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ex: /polls/5/results/</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:question_id&gt;/results/"</span>, views.results, name=<span style="color: #008000;">"results"</span>),
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">ex: /polls/5/vote/</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:question_id&gt;/vote/"</span>, views.vote, name=<span style="color: #008000;">"vote"</span>),
]
</pre>
</div>

<p>
Ouvrez votre navigateur à l'adresse <code>/polls/34/</code>. La fonction <code>detail()</code> sera exécutée et affichera l'ID fourni dans l'URL. Essayez aussi <code>/polls/34/results/</code> et <code>/polls/34/vote/</code>, elles afficheront les pages modèles de résultats et de votes.
</p>

<p>
Lorsque quelqu'un demande une page de votre site Web, par exemple <code>/polls/34/</code>, Django charge le module Python <code>mysite.urls</code> parce qu'il est mentionné dans le réglage <code>ROOT_URLCONF</code>. Il trouve la variable nommée <code>urlpatterns</code> et parcourt les motifs dans l'ordre. Après avoir trouvé la correspondance <code>polls/</code>, il retire le texte correspondant ("polls/") et passe le texte restant – "34/" – à la configuration d'URL “polls.urls” pour la suite du traitement. Là, c'est <code>&lt;int:question_id&gt;/</code> qui correspond ce qui aboutit à un appel à la vue <code>detail()</code> comme ceci :
</p>

<div class="org-src-container">
<pre class="src src-python">detail(request=&lt;HttpRequest <span style="color: #006FE0;">object</span>&gt;, question_id=34)
</pre>
</div>

<p>
La partie <code>question_id=34</code> vient de <code>&lt;int:question_id&gt;</code>. En utilisant des chevrons, cela capture une partie de l'URL l'envoie en tant que paramètre nommé à la fonction de vue ; la partie <code>question_id</code> de la chaîne définit le nom qui va être utilisé pour identifier le motif trouvé, et la partie <code>int</code> est un convertisseur qui détermine ce à quoi les motifs doivent correspondre dans cette partie du chemin d'URL. Le caractère deux-points (:) sépare le convertisseur du nom de la partie capturée.
</p>
</div>
</div>

<div id="outline-container-org44424fe" class="outline-3">
<h3 id="org44424fe"><span class="section-number-3">9.4.</span> Écriture de vues qui font réellement des choses</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Chaque vue est responsable de faire une des deux choses suivantes : retourner un objet HttpResponse contenant le contenu de la page demandée, ou lever une exception, comme par exemple Http404. Le reste, c'est votre travail.
</p>

<p>
Votre vue peut lire des entrées depuis une base de données, ou pas. Elle peut utiliser un système de gabarits comme celui de Django – ou un système de gabarits tiers – ou pas. Elle peut générer un fichier PDF, produire de l'XML, créer un fichier ZIP à la volée, tout ce que vous voulez, en utilisant les bibliothèques Python que vous voulez.
</p>
</div>

<div id="outline-container-orgf3aba79" class="outline-4">
<h4 id="orgf3aba79"><span class="section-number-4">9.4.1.</span> Codage en dur sans gabarit</h4>
<div class="outline-text-4" id="text-9-4-1">
<p>
L'allure de la page est codée en dur dans la vue.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">latestQuestions</span>(request):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">latest_question_list</span> = Question.objects.order_by(<span style="color: #008000;">"-pub_date"</span>)[:5]
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">output</span> = <span style="color: #008000;">", "</span>.join([q.question_text <span style="color: #0000FF;">for</span> q <span style="color: #0000FF;">in</span> latest_question_list])
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(output)
</pre>
</div>
</div>
</div>
