tutoriel.org
*** Codage avec gabarits

Le système de gabarits de Django permet de séparer le style du code Python en créant un gabarit que la vue pourra utiliser.

- Tout d'abord, créez un répertoire nommé ~templates~ dans votre répertoire ~polls~. C'est là que Django recherche les gabarits. Le paramètre ~TEMPLATES~ de votre projet indique comment Django va charger et produire les gabarits. Le fichier de réglages par défaut configure un moteur ~DjangoTemplates~ dont l'option ~APP_DIRS~ est définie à ~True~. Par convention, ~DjangoTemplates~ recherche un sous-répertoire ~templates~ dans chaque application figurant dans ~INSTALLED_APPS~.

- Dans le répertoire templates que vous venez de créer, créez un autre répertoire nommé ~polls~ dans lequel vous placez un nouveau fichier ~index.html~.
Autrement dit, le chemin de votre gabarit doit être ~polls/templates/polls/index.html~. Conformément au fonctionnement du chargeur de gabarit ~app_directories~ (cf. explication ci-dessus), vous pouvez désigner ce gabarit dans Django par ~polls/index.html~.

Insérez le code suivant dans ce gabarit :

#+begin_src html name='polls/templates/polls/index.html'
{% if latest_question_list %}
    <ul>
    {% for question in latest_question_list %}
        Codé de la mauvaise manière:   
        <li><a href="/polls/{{ question.id }}/">{{ question.question_text }}</a></li>
        Codé de la bonne manière en utilisant app_name et le paramètre name dans les fonctions path():
        <li><a href="{% url 'polls:detail' question.id %}">{{ question.question_text }}</a></li>
    {% endfor %}
    </ul>
{% else %}
    <p>No polls are available.</p>
{% endif %}
#+end_src


Mettons maintenant à jour notre vue index dans ~polls/views.py~ pour qu'elle utilise le template :

#+begin_src python :exports code name='polls/views.py'
from django.http import HttpResponse
from django.template import loader

from .models import Question

def index(request):
    latest_question_list = Question.objects.order_by("-pub_date")[:5]
    template = loader.get_template("polls/index.html")
    context = {
        "latest_question_list": latest_question_list,
    }
    return HttpResponse(template.render(context, request))
#+end_src
    
Ce code charge le gabarit appelé ~polls/index.html~ et lui fournit un contexte.
Ce contexte est un dictionnaire qui fait correspondre des objets Python à des noms de variables de gabarit.

Chargez la page en appelant l'URL ~/polls/~ dans votre navigateur et vous devriez voir une liste à puces contenant des liens pointant vers la page de détail de la question sélectionnée.


*** Codage propre avec gabarits


Il est très courant de charger un gabarit, remplir un contexte et renvoyer un objet HttpResponse avec le résultat du gabarit interprété. Django fournit un raccourci pour cela : ~render()~

Voici les vues ~index()~ et ~detail()~ réécrites avec ~render()~ :

#+begin_src python   :exports code name='polls/views.py'
from django.http import HttpResponse
from django.template import loader
from django.shortcuts import get_object_or_404, render

from .models import Question

def index(request):
    latest_question_list = Question.objects.order_by("-pub_date")[:5]
    context = {"latest_question_list": latest_question_list}
    return render(request, "polls/index.html", context)

def detail(request, question_id):
    question = get_object_or_404(Question, pk=question_id)
    context = {"question": question}
    return render(request, "polls/detail.html", context)
#+end_src
    
Notez qu'une fois que nous avons fait ceci dans toutes nos vues, nous n'avons plus à importer ~loader~ et ~HttpResponse~ (il faut conserver ~HttpResponse~ tant que les méthodes initiales pour ~detail~, ~results~ et ~vote~ sont présentes).

- La fonction ~render()~ prend comme premier paramètre l'objet requête, un nom de gabarit comme deuxième paramètre et un dictionnaire comme troisième paramètre facultatif. Elle retourne un objet ~HttpResponse~ composé par le gabarit interprété avec le contexte donné.

- La fonction ~get_object_or_404()~ prend un modèle Django comme premier paramètre et un nombre arbitraire de paramètres mots-clés, qu'il transmet à la méthode ~get()~ du gestionnaire du modèle. Elle lève une exception ~Http404~ si l'objet n'existe pas.

- Il y a aussi une fonction ~get_list_or_404()~, qui fonctionne comme ~get_object_or_404()~, sauf qu'elle utilise ~filter()~ au lieu de la méthode ~get()~. Elle lève une exception Http404 si la liste est vide.


*** Espace de noms des gabarits

Il serait aussi possible de placer directement nos gabarits dans ~polls/templates~ (plutôt que dans un sous-répertoire ~polls~), mais ce serait une mauvaise idée. Django choisit le premier gabarit qu'il trouve pour un nom donné et dans le cas où vous avez un gabarit de même nom dans une autre application, Django ne fera pas la différence. Il faut pouvoir indiquer à Django le bon gabarit, et la meilleure manière de faire cela est d'utiliser des espaces de noms. C'est-à-dire que nous plaçons ces gabarits dans un autre répertoire portant le nom de l'application.


* Écriture de formulaires
