tutoriel.html

<div id="outline-container-orgf1ed87e" class="outline-4">
<h4 id="orgf1ed87e"><span class="section-number-4">9.4.2.</span> Codage avec gabarits</h4>
<div class="outline-text-4" id="text-9-4-2">
<p>
Le système de gabarits de Django permet de séparer le style du code Python en créant un gabarit que la vue pourra utiliser.
</p>

<ul class="org-ul">
<li>Tout d'abord, créez un répertoire nommé <code>templates</code> dans votre répertoire <code>polls</code>. C'est là que Django recherche les gabarits. Le paramètre <code>TEMPLATES</code> de votre projet indique comment Django va charger et produire les gabarits. Le fichier de réglages par défaut configure un moteur <code>DjangoTemplates</code> dont l'option <code>APP_DIRS</code> est définie à <code>True</code>. Par convention, <code>DjangoTemplates</code> recherche un sous-répertoire <code>templates</code> dans chaque application figurant dans <code>INSTALLED_APPS</code>.</li>

<li>Dans le répertoire templates que vous venez de créer, créez un autre répertoire nommé <code>polls</code> dans lequel vous placez un nouveau fichier <code>index.html</code>.</li>
</ul>
<p>
Autrement dit, le chemin de votre gabarit doit être <code>polls/templates/polls/index.html</code>. Conformément au fonctionnement du chargeur de gabarit <code>app_directories</code> (cf. explication ci-dessus), vous pouvez désigner ce gabarit dans Django par <code>polls/index.html</code>.
</p>

<p>
Insérez le code suivant dans ce gabarit :
</p>

<div class="org-src-container">
<pre class="src src-html">{% if latest_question_list %}
    &lt;<span style="color: #006699;">ul</span>&gt;
    {% for question in latest_question_list %}
        Cod&#233; de la mauvaise mani&#232;re:   
        &lt;<span style="color: #006699;">li</span>&gt;&lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"/polls/{{ question.id }}/"</span>&gt;{{ question.question_text }}&lt;/<span style="color: #006699;">a</span>&gt;&lt;/<span style="color: #006699;">li</span>&gt;
        Cod&#233; de la bonne mani&#232;re en utilisant app_name et le param&#232;tre name dans les fonctions path():
        &lt;<span style="color: #006699;">li</span>&gt;&lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"{% url 'polls:detail' question.id %}"</span>&gt;{{ question.question_text }}&lt;/<span style="color: #006699;">a</span>&gt;&lt;/<span style="color: #006699;">li</span>&gt;
    {% endfor %}
    &lt;/<span style="color: #006699;">ul</span>&gt;
{% else %}
    &lt;<span style="color: #006699;">p</span>&gt;No polls are available.&lt;/<span style="color: #006699;">p</span>&gt;
{% endif %}
</pre>
</div>


<p>
Mettons maintenant à jour notre vue index dans <code>polls/views.py</code> pour qu'elle utilise le template :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.http <span style="color: #0000FF;">import</span> HttpResponse
<span style="color: #0000FF;">from</span> django.template <span style="color: #0000FF;">import</span> loader

<span style="color: #0000FF;">from</span> .models <span style="color: #0000FF;">import</span> Question

<span style="color: #0000FF;">def</span> <span style="color: #006699;">index</span>(request):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">latest_question_list</span> = Question.objects.order_by(<span style="color: #008000;">"-pub_date"</span>)[:5]
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">template</span> = loader.get_template(<span style="color: #008000;">"polls/index.html"</span>)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">context</span> = {
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #008000;">"latest_question_list"</span>: latest_question_list,
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   }
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> HttpResponse(template.render(context, request))
</pre>
</div>

<p>
Ce code charge le gabarit appelé <code>polls/index.html</code> et lui fournit un contexte.
Ce contexte est un dictionnaire qui fait correspondre des objets Python à des noms de variables de gabarit.
</p>

<p>
Chargez la page en appelant l'URL <code>/polls/</code> dans votre navigateur et vous devriez voir une liste à puces contenant des liens pointant vers la page de détail de la question sélectionnée.
</p>
</div>
</div>


<div id="outline-container-org40c7e95" class="outline-4">
<h4 id="org40c7e95"><span class="section-number-4">9.4.3.</span> Codage propre avec gabarits</h4>
<div class="outline-text-4" id="text-9-4-3">
<p>
Il est très courant de charger un gabarit, remplir un contexte et renvoyer un objet HttpResponse avec le résultat du gabarit interprété. Django fournit un raccourci pour cela : <code>render()</code>
</p>

<p>
Voici les vues <code>index()</code> et <code>detail()</code> réécrites avec <code>render()</code> :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.http <span style="color: #0000FF;">import</span> HttpResponse
<span style="color: #0000FF;">from</span> django.template <span style="color: #0000FF;">import</span> loader
<span style="color: #0000FF;">from</span> django.shortcuts <span style="color: #0000FF;">import</span> get_object_or_404, render

<span style="color: #0000FF;">from</span> .models <span style="color: #0000FF;">import</span> Question

<span style="color: #0000FF;">def</span> <span style="color: #006699;">index</span>(request):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">latest_question_list</span> = Question.objects.order_by(<span style="color: #008000;">"-pub_date"</span>)[:5]
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">context</span> = {<span style="color: #008000;">"latest_question_list"</span>: latest_question_list}
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> render(request, <span style="color: #008000;">"polls/index.html"</span>, context)

<span style="color: #0000FF;">def</span> <span style="color: #006699;">detail</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">question</span> = get_object_or_404(Question, pk=question_id)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   context = {<span style="color: #008000;">"question"</span>: question}
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> render(request, <span style="color: #008000;">"polls/detail.html"</span>, context)
</pre>
</div>

<p>
Notez qu'une fois que nous avons fait ceci dans toutes nos vues, nous n'avons plus à importer <code>loader</code> et <code>HttpResponse</code> (il faut conserver <code>HttpResponse</code> tant que les méthodes initiales pour <code>detail</code>, <code>results</code> et <code>vote</code> sont présentes).
</p>

<ul class="org-ul">
<li>La fonction <code>render()</code> prend comme premier paramètre l'objet requête, un nom de gabarit comme deuxième paramètre et un dictionnaire comme troisième paramètre facultatif. Elle retourne un objet <code>HttpResponse</code> composé par le gabarit interprété avec le contexte donné.</li>

<li>La fonction <code>get_object_or_404()</code> prend un modèle Django comme premier paramètre et un nombre arbitraire de paramètres mots-clés, qu'il transmet à la méthode <code>get()</code> du gestionnaire du modèle. Elle lève une exception <code>Http404</code> si l'objet n'existe pas.</li>

<li>Il y a aussi une fonction <code>get_list_or_404()</code>, qui fonctionne comme <code>get_object_or_404()</code>, sauf qu'elle utilise <code>filter()</code> au lieu de la méthode <code>get()</code>. Elle lève une exception Http404 si la liste est vide.</li>
</ul>
</div>
</div>


<div id="outline-container-orgee03790" class="outline-4">
<h4 id="orgee03790"><span class="section-number-4">9.4.4.</span> Espace de noms des gabarits</h4>
<div class="outline-text-4" id="text-9-4-4">
<p>
Il serait aussi possible de placer directement nos gabarits dans <code>polls/templates</code> (plutôt que dans un sous-répertoire <code>polls</code>), mais ce serait une mauvaise idée. Django choisit le premier gabarit qu'il trouve pour un nom donné et dans le cas où vous avez un gabarit de même nom dans une autre application, Django ne fera pas la différence. Il faut pouvoir indiquer à Django le bon gabarit, et la meilleure manière de faire cela est d'utiliser des espaces de noms. C'est-à-dire que nous plaçons ces gabarits dans un autre répertoire portant le nom de l'application.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org8929ac0" class="outline-2">
<h2 id="org8929ac0"><span class="section-number-2">10.</span> Écriture de formulaires</h2>
<div class="outline-text-2" id="text-10">
</div>
