tutoriel.org
** Écriture d'un formulaire minimal

Nous allons mettre à jour le gabarit de la page de détail (~polls/details.html~) du tutoriel précédent, de manière à ce que le gabarit contienne une balise HTML <form> :

#+begin_src html name='polls/templates/polls/detail.html'
<form action="{% url 'polls:vote' question.id %}" method="post">
{% csrf_token %}
<fieldset>
    <legend><h1>{{ question.question_text }}</h1></legend>
    {% if error_message %}<p><strong>{{ error_message }}</strong></p>{% endif %}
    {% for choice in question.choice_set.all %}
        <input type="radio" name="choice" id="choice{{ forloop.counter }}" value="{{ choice.id }}">
        <label for="choice{{ forloop.counter }}">{{ choice.choice_text }}</label><br>
    {% endfor %}
</fieldset>
<input type="submit" value="Vote">
</form>
#+end_src


** Un résumé rapide

- Ce gabarit affiche un bouton radio pour chaque choix de question. L'attribut value de chaque bouton radio correspond à l'ID du vote choisi. Le nom (name) de chaque bouton radio est "choice". Cela signifie que lorsque quelqu'un sélectionne l'un des boutons radio et valide le formulaire, les données POST choice=# (où # est l'identifiant du choix sélectionné) seront envoyées. Ce sont les concepts de base des formulaires HTML.
- Nous avons défini ~{% url 'polls:vote' question.id %}~ comme attribut action du formulaire, et nous avons précisé ~method="post"~. L'utilisation de ~method="post"~ ( par opposition à ~method="get"~ ) est très importante, puisque le fait de valider ce formulaire va entraîner des modifications de données sur le serveur. À chaque fois qu'un formulaire modifie des données sur le serveur, vous devez utiliser ~method="post"~. Cela ne concerne pas uniquement Django ; c'est une bonne pratique à adopter en tant que développeur Web.
- ~forloop.counter~ indique combien de fois la balise for a exécuté sa boucle.
- Comme nous créons un *formulaire POST* (qui modifie potentiellement des données), il faut se préoccuper des attaques inter-sites. Heureusement, vous ne devez pas réfléchir trop longtemps car Django offre un moyen pratique à utiliser pour s'en protéger. En bref, tous les formulaires POST destinés à des URL internes doivent utiliser la balise de gabarit ~{% csrf_token %}~.

* Affichage des résultats

Reprenons les principes précédents pour afficher les résultats. 

Après le vote d'une personne dans une question, la vue ~vote()~ redirige vers la page de résultats de la question.

** Réécrivons la vue ~results()~ dans ~polls/views.py~ :

#+begin_src python :exports code name="polls/views.py" 
from django.shortcuts import get_object_or_404, render

def results(request, question_id):
    question = get_object_or_404(Question, pk=question_id)
    return render(request, "polls/results.html", {"question": question})
#+end_src

Cette vue requiert le gabarit ~polls/results.html~. 

** Écrivons maintenant le gabarit ~polls/results.html~ :

#+begin_src html 
<h1>{{ question.question_text }}</h1>

<ul>
{% for choice in question.choice_set.all %}
    <li>{{ choice.choice_text }} -- {{ choice.votes }} vote{{ choice.votes|pluralize }}</li>
{% endfor %}
</ul>

<a href="{% url 'polls:detail' question.id %}">Vote again?</a>
#+end_src


* Utilisation des vues génériques

Les vues ~index()~, ~detail()~ et ~results()~ sont très courtes et représentent un cas classique du développement Web : *récupérer les données depuis la base de données suivant un paramètre contenu dans l'URL, charger un gabarit et renvoyer le gabarit interprété*. Ce cas est tellement classique que Django propose un raccourci, appelé le système de *vues génériques*.

Les vues génériques ajoutent une couche d'abstraction pour les procédés courants au point où vous n'avez même plus besoin d'écrire du code Python pour écrire une application.

Les deux vues suivantes sont *les vues génériques d'affichage* ; elles sont conçues pour afficher des données. Pour beaucoup de projets, il s’agit habituellement des vues les plus fréquemment utilisées :
- la vue générique ~ListView~ implémente le concept d'*afficher une liste d'objets*  ;
- la vue générique ~DetailView~ implémente celui d'*afficher une page détaillée pour un type particulier d'objet*.
Elles sont fondées sur des classes pas sur des fonctions.

Nous allons convertir notre application de sondage pour qu'elle utilise le système de vues génériques.

