tutoriel.html
<div id="outline-container-org3a61c32" class="outline-3">
<h3 id="org3a61c32"><span class="section-number-3">10.1.</span> Écriture d'un formulaire minimal</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Nous allons mettre à jour le gabarit de la page de détail (<code>polls/details.html</code>) du tutoriel précédent, de manière à ce que le gabarit contienne une balise HTML &lt;form&gt; :
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">form</span> <span style="color: #BA36A5;">action</span>=<span style="color: #008000;">"{% url 'polls:vote' question.id %}"</span> <span style="color: #BA36A5;">method</span>=<span style="color: #008000;">"post"</span>&gt;
{% csrf_token %}
&lt;<span style="color: #006699;">fieldset</span>&gt;
    &lt;<span style="color: #006699;">legend</span>&gt;&lt;<span style="color: #006699;">h1</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">{{ question.question_text }}</span>&lt;/<span style="color: #006699;">h1</span>&gt;&lt;/<span style="color: #006699;">legend</span>&gt;
    {% if error_message %}&lt;<span style="color: #006699;">p</span>&gt;&lt;<span style="color: #006699;">strong</span>&gt;<span style="color: #000000; font-weight: bold;">{{ error_message }}</span>&lt;/<span style="color: #006699;">strong</span>&gt;&lt;/<span style="color: #006699;">p</span>&gt;{% endif %}
    {% for choice in question.choice_set.all %}
        &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"radio"</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"choice"</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"choice{{ forloop.counter }}"</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"{{ choice.id }}"</span>&gt;
        &lt;<span style="color: #006699;">label</span> <span style="color: #BA36A5;">for</span>=<span style="color: #008000;">"choice{{ forloop.counter }}"</span>&gt;{{ choice.choice_text }}&lt;/<span style="color: #006699;">label</span>&gt;&lt;<span style="color: #006699;">br</span>&gt;
    {% endfor %}
&lt;/<span style="color: #006699;">fieldset</span>&gt;
&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"submit"</span> <span style="color: #BA36A5;">value</span>=<span style="color: #008000;">"Vote"</span>&gt;
&lt;/<span style="color: #006699;">form</span>&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org55b9b58" class="outline-3">
<h3 id="org55b9b58"><span class="section-number-3">10.2.</span> Un résumé rapide</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>Ce gabarit affiche un bouton radio pour chaque choix de question. L'attribut value de chaque bouton radio correspond à l'ID du vote choisi. Le nom (name) de chaque bouton radio est "choice". Cela signifie que lorsque quelqu'un sélectionne l'un des boutons radio et valide le formulaire, les données POST choice=# (où # est l'identifiant du choix sélectionné) seront envoyées. Ce sont les concepts de base des formulaires HTML.</li>
<li>Nous avons défini <code>{% url 'polls:vote' question.id %}</code> comme attribut action du formulaire, et nous avons précisé <code>method="post"</code>. L'utilisation de <code>method="post"</code> ( par opposition à <code>method="get"</code> ) est très importante, puisque le fait de valider ce formulaire va entraîner des modifications de données sur le serveur. À chaque fois qu'un formulaire modifie des données sur le serveur, vous devez utiliser <code>method="post"</code>. Cela ne concerne pas uniquement Django ; c'est une bonne pratique à adopter en tant que développeur Web.</li>
<li><code>forloop.counter</code> indique combien de fois la balise for a exécuté sa boucle.</li>
<li>Comme nous créons un <b>formulaire POST</b> (qui modifie potentiellement des données), il faut se préoccuper des attaques inter-sites. Heureusement, vous ne devez pas réfléchir trop longtemps car Django offre un moyen pratique à utiliser pour s'en protéger. En bref, tous les formulaires POST destinés à des URL internes doivent utiliser la balise de gabarit <code>{% csrf_token %}</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org70de290" class="outline-2">
<h2 id="org70de290"><span class="section-number-2">11.</span> Affichage des résultats</h2>
<div class="outline-text-2" id="text-11">
<p>
Reprenons les principes précédents pour afficher les résultats. 
</p>

<p>
Après le vote d'une personne dans une question, la vue <code>vote()</code> redirige vers la page de résultats de la question.
</p>
</div>

<div id="outline-container-org8924eec" class="outline-3">
<h3 id="org8924eec"><span class="section-number-3">11.1.</span> Réécrivons la vue <code>results()</code> dans <code>polls/views.py</code> :</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.shortcuts <span style="color: #0000FF;">import</span> get_object_or_404, render

<span style="color: #0000FF;">def</span> <span style="color: #006699;">results</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">question</span> = get_object_or_404(Question, pk=question_id)
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> render(request, <span style="color: #008000;">"polls/results.html"</span>, {<span style="color: #008000;">"question"</span>: question})
</pre>
</div>

<p>
Cette vue requiert le gabarit <code>polls/results.html</code>. 
</p>
</div>
</div>

<div id="outline-container-org5345bf0" class="outline-3">
<h3 id="org5345bf0"><span class="section-number-3">11.2.</span> Écrivons maintenant le gabarit <code>polls/results.html</code> :</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">h1</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">{{ question.question_text }}</span>&lt;/<span style="color: #006699;">h1</span>&gt;

&lt;<span style="color: #006699;">ul</span>&gt;
{% for choice in question.choice_set.all %}
    &lt;<span style="color: #006699;">li</span>&gt;{{ choice.choice_text }} -- {{ choice.votes }} vote{{ choice.votes|pluralize }}&lt;/<span style="color: #006699;">li</span>&gt;
{% endfor %}
&lt;/<span style="color: #006699;">ul</span>&gt;

&lt;<span style="color: #006699;">a</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"{% url 'polls:detail' question.id %}"</span>&gt;Vote again?&lt;/<span style="color: #006699;">a</span>&gt;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgb5ac442" class="outline-2">
<h2 id="orgb5ac442"><span class="section-number-2">12.</span> Utilisation des vues génériques</h2>
<div class="outline-text-2" id="text-12">
<p>
Les vues <code>index()</code>, <code>detail()</code> et <code>results()</code> sont très courtes et représentent un cas classique du développement Web : <b>récupérer les données depuis la base de données suivant un paramètre contenu dans l'URL, charger un gabarit et renvoyer le gabarit interprété</b>. Ce cas est tellement classique que Django propose un raccourci, appelé le système de <b>vues génériques</b>.
</p>

<p>
Les vues génériques ajoutent une couche d'abstraction pour les procédés courants au point où vous n'avez même plus besoin d'écrire du code Python pour écrire une application.
</p>

<p>
Les deux vues suivantes sont <b>les vues génériques d'affichage</b> ; elles sont conçues pour afficher des données. Pour beaucoup de projets, il s’agit habituellement des vues les plus fréquemment utilisées :
</p>
<ul class="org-ul">
<li>la vue générique <code>ListView</code> implémente le concept d'<b>afficher une liste d'objets</b>  ;</li>
<li>la vue générique <code>DetailView</code> implémente celui d'<b>afficher une page détaillée pour un type particulier d'objet</b>.</li>
</ul>
<p>
Elles sont fondées sur des classes pas sur des fonctions.
</p>

<p>
Nous allons convertir notre application de sondage pour qu'elle utilise le système de vues génériques.
</p>
</div>
