tutoriel.org
** Écriture de l'URLconf


La manière la plus directe d'utiliser des vues génériques est de les créer directement dans votre configuration d'URL. Si vous ne devez changer qu'un nombre restreint d'attributs d'une vue fondée sur une classe, vous pouvez les transmettre directement dans l'appel de méthode ~as_view()~. Tout paramètre transmis à ~as_view()~ surcharge l'attribut de même nom de la classe.

Ici, nous aurions pu simplement transmettre le paramètre ~template_name = "polls/detail.html"~ dans l'appel ~as_view()~ en écrivant ~path("<int:pk>/", views.DetailView.as_view(template_name = "polls/detail.html"), name="detail")~ et nous aurions pu faire de même pour ~template_name = "polls/results.html"~ mais nous n'allons pas le faire car nous  allons plutôt utiliser l'héritage des vues génériques dans l'écriture des vues, juste après.

Ouvrez la configuration d'URL ~polls/urls.py~ et modifiez-la ainsi :

#+begin_src python :exports code name="polls/urls.py"
from django.urls import path

from . import views

app_name = "polls"
urlpatterns = [
    # recours aux vues génériques
    path("", views.IndexView.as_view(), name="index"),
    path("<int:pk>/", views.DetailView.as_view(), name="detail"),
    path("<int:pk>/results/", views.ResultsView.as_view(), name="results"),
    # recours à une vue classique
    path("<int:question_id>/vote/", views.vote, name="vote"),
]
#+end_src

Notez que le nom des motifs de correspondance dans les chaînes de chemin des deuxième et troisième motifs ont changé de ~<question_id>~ à ~<pk>~. Ceci est nécessaire car la vue générique ~DetailView~ sera utilisée pour remplacer les vues ~detail()~ et ~results()~, et que cette vue s'attend à ce que la valeur de clé primaire capturée dans l'URL soit nommée "pk".

Pourquoi utiliser ~as_view()~ dans ce cas puisqu'à ce stade nous ne modifions aucun attribut?

Dans les vues basées sur les classes, *vous devez appeler la fonction ~as_view()~ afin de renvoyer une vue qui prend une requête et renvoie une réponse*. C'est le principal point d'entrée dans le cycle requête-réponse en cas de vues génériques. ~as_view~ est la fonction (méthode de classe) qui connectera votre classe ~MyView~ (ici ~IndexView~, ~DetailView~ et ~ResultsView~) à son URL.

** Écriture des vues

Plutôt que de transmettre les paramètres directement dans l'appel de méthode ~as_view()~ , l'autre façon de faire, plus puissante, d'utiliser les vues génériques est d'hériter d'une vue existante et de surcharger ses attributs (comme ~template_name~) ou ses méthodes (comme ~get_queryset~) dans votre sous-classe pour fournir d'autres valeurs ou méthodes. 

Nous allons enlever les anciennes vues ~index~, ~detail~ et ~results~ et utiliser à la place des vues génériques de Django. Pour cela, ouvrez le fichier ~polls/views.py~ et modifiez-le de cette façon :

#+begin_src python :exports code name="polls/views.py"
from django.db.models import F
from django.http import HttpResponseRedirect
from django.shortcuts import get_object_or_404, render
from django.urls import reverse
from django.views import generic

from .models import Choice, Question

class IndexView(generic.ListView):
    template_name = "polls/index.html"
    context_object_name = "latest_question_list"

    def get_queryset(self):
        """Return the last five published questions."""
        return Question.objects.order_by("-pub_date")[:5]

class DetailView(generic.DetailView):
    model = Question
    template_name = "polls/detail.html"

class ResultsView(generic.DetailView):
    model = Question
    template_name = "polls/results.html"

def vote(request, question_id):
    # same as above, no changes needed.
    ...
#+end_src

*Chaque vue générique doit connaître le modèle sur lequel elle agira.*

Pour cela, on utilise :
- soit l'attribut ~model~ (dans cet exemple, ~model = Question~ pour ~DetailView~ et ~ResultsView~),
- soit on définit la méthode ~get_queryset()~ (tel qu'illustré pour la vue ~IndexView~).

Par défaut, la vue générique ~DetailView~ utilise un gabarit appelé ~<nom app>/<nom modèle>_detail.html~. Dans notre cas, elle utiliserait le gabarit "~polls/question_detail.html~". L'attribut ~template_name~ est utilisé pour signifier à Django d'utiliser un nom de gabarit spécifique plutôt que le nom de gabarit par défaut. Nous avons aussi indiqué le paramètre ~template_name~ pour la vue de liste ~results~, ce qui permet de différencier l'apparence du rendu des vues  ~results~  et ~detail~, même s'il s'agit dans les deux cas de vues ~DetailView~ à la base.

De la même façon, la vue générique ~ListView~ utilise par défaut un gabarit appelé ~<nom app>/<nom modèle>_list.html~ ; nous utilisons ~template_name~ pour indiquer à ~ListView~ d'utiliser notre gabarit existant "~polls/index.html~".

Dans les parties précédentes de ce tutoriel, les templates ont été renseignés avec un contexte qui contenait les variables de contexte ~question~ et ~latest_question_list~. Pour ~DetailView~, la variable ~question~ est fournie automatiquement ; comme nous utilisons un modèle nommé ~Question~, Django sait donner un nom approprié à la variable de contexte. Cependant, pour ~ListView~, la variable de contexte générée automatiquement s'appelle ~question_list~. Pour changer cela, nous fournissons l'attribut ~context_object_name~ pour indiquer que nous souhaitons plutôt la nommer ~latest_question_list~. Il serait aussi possible de modifier les templates en utilisant les nouveaux nom de variables par défaut, mais il est beaucoup plus simple d'indiquer à Django les noms de variables que nous souhaitons.


* Introduction aux tests automatisés

