tutoriel.html

<div id="outline-container-orgb87b683" class="outline-3">
<h3 id="orgb87b683"><span class="section-number-3">12.1.</span> Écriture de l'URLconf</h3>
<div class="outline-text-3" id="text-12-1">
<p>
La manière la plus directe d'utiliser des vues génériques est de les créer directement dans votre configuration d'URL. Si vous ne devez changer qu'un nombre restreint d'attributs d'une vue fondée sur une classe, vous pouvez les transmettre directement dans l'appel de méthode <code>as_view()</code>. Tout paramètre transmis à <code>as_view()</code> surcharge l'attribut de même nom de la classe.
</p>

<p>
Ici, nous aurions pu simplement transmettre le paramètre <code>template_name = "polls/detail.html"</code> dans l'appel <code>as_view()</code> en écrivant <code>path("&lt;int:pk&gt;/", views.DetailView.as_view(template_name = "polls/detail.html"), name="detail")</code> et nous aurions pu faire de même pour <code>template_name = "polls/results.html"</code> mais nous n'allons pas le faire car nous  allons plutôt utiliser l'héritage des vues génériques dans l'écriture des vues, juste après.
</p>

<p>
Ouvrez la configuration d'URL <code>polls/urls.py</code> et modifiez-la ainsi :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.urls <span style="color: #0000FF;">import</span> path

<span style="color: #0000FF;">from</span> . <span style="color: #0000FF;">import</span> views

<span style="color: #BA36A5;">app_name</span> = <span style="color: #008000;">"polls"</span>
<span style="color: #BA36A5;">urlpatterns</span> = [
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">recours aux vues g&#233;n&#233;riques</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">""</span>, views.IndexView.as_view(), name=<span style="color: #008000;">"index"</span>),
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:pk&gt;/"</span>, views.DetailView.as_view(), name=<span style="color: #008000;">"detail"</span>),
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:pk&gt;/results/"</span>, views.ResultsView.as_view(), name=<span style="color: #008000;">"results"</span>),
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">recours &#224; une vue classique</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   path(<span style="color: #008000;">"&lt;int:question_id&gt;/vote/"</span>, views.vote, name=<span style="color: #008000;">"vote"</span>),
]
</pre>
</div>

<p>
Notez que le nom des motifs de correspondance dans les chaînes de chemin des deuxième et troisième motifs ont changé de <code>&lt;question_id&gt;</code> à <code>&lt;pk&gt;</code>. Ceci est nécessaire car la vue générique <code>DetailView</code> sera utilisée pour remplacer les vues <code>detail()</code> et <code>results()</code>, et que cette vue s'attend à ce que la valeur de clé primaire capturée dans l'URL soit nommée "pk".
</p>

<p>
Pourquoi utiliser <code>as_view()</code> dans ce cas puisqu'à ce stade nous ne modifions aucun attribut?
</p>

<p>
Dans les vues basées sur les classes, <b>vous devez appeler la fonction <code>as_view()</code> afin de renvoyer une vue qui prend une requête et renvoie une réponse</b>. C'est le principal point d'entrée dans le cycle requête-réponse en cas de vues génériques. <code>as_view</code> est la fonction (méthode de classe) qui connectera votre classe <code>MyView</code> (ici <code>IndexView</code>, <code>DetailView</code> et <code>ResultsView</code>) à son URL.
</p>
</div>
</div>

<div id="outline-container-orgdffa37e" class="outline-3">
<h3 id="orgdffa37e"><span class="section-number-3">12.2.</span> Écriture des vues</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Plutôt que de transmettre les paramètres directement dans l'appel de méthode <code>as_view()</code> , l'autre façon de faire, plus puissante, d'utiliser les vues génériques est d'hériter d'une vue existante et de surcharger ses attributs (comme <code>template_name</code>) ou ses méthodes (comme <code>get_queryset</code>) dans votre sous-classe pour fournir d'autres valeurs ou méthodes. 
</p>

<p>
Nous allons enlever les anciennes vues <code>index</code>, <code>detail</code> et <code>results</code> et utiliser à la place des vues génériques de Django. Pour cela, ouvrez le fichier <code>polls/views.py</code> et modifiez-le de cette façon :
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">from</span> django.db.models <span style="color: #0000FF;">import</span> F
<span style="color: #0000FF;">from</span> django.http <span style="color: #0000FF;">import</span> HttpResponseRedirect
<span style="color: #0000FF;">from</span> django.shortcuts <span style="color: #0000FF;">import</span> get_object_or_404, render
<span style="color: #0000FF;">from</span> django.urls <span style="color: #0000FF;">import</span> reverse
<span style="color: #0000FF;">from</span> django.views <span style="color: #0000FF;">import</span> generic

<span style="color: #0000FF;">from</span> .models <span style="color: #0000FF;">import</span> Choice, Question

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">IndexView</span>(generic.ListView):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">template_name</span> = <span style="color: #008000;">"polls/index.html"</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">context_object_name</span> = <span style="color: #008000;">"latest_question_list"</span>

<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">def</span> <span style="color: #006699;">get_queryset</span>(<span style="color: #0000FF;">self</span>):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #036A07;">"""Return the last five published questions."""</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #0000FF;">return</span> Question.objects.order_by(<span style="color: #008000;">"-pub_date"</span>)[:5]

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">DetailView</span>(generic.DetailView):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">model</span> = Question
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">template_name</span> = <span style="color: #008000;">"polls/detail.html"</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ResultsView</span>(generic.DetailView):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">model</span> = Question
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #BA36A5;">template_name</span> = <span style="color: #008000;">"polls/results.html"</span>

<span style="color: #0000FF;">def</span> <span style="color: #006699;">vote</span>(request, question_id):
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">same as above, no changes needed.</span>
<span style="color: #4C9ED9; background-color: #ffffff;"> </span>   ...
</pre>
</div>

<p>
<b>Chaque vue générique doit connaître le modèle sur lequel elle agira.</b>
</p>

<p>
Pour cela, on utilise :
</p>
<ul class="org-ul">
<li>soit l'attribut <code>model</code> (dans cet exemple, <code>model = Question</code> pour <code>DetailView</code> et <code>ResultsView</code>),</li>
<li>soit on définit la méthode <code>get_queryset()</code> (tel qu'illustré pour la vue <code>IndexView</code>).</li>
</ul>

<p>
Par défaut, la vue générique <code>DetailView</code> utilise un gabarit appelé <code>&lt;nom app&gt;/&lt;nom modèle&gt;_detail.html</code>. Dans notre cas, elle utiliserait le gabarit "<code>polls/question_detail.html</code>". L'attribut <code>template_name</code> est utilisé pour signifier à Django d'utiliser un nom de gabarit spécifique plutôt que le nom de gabarit par défaut. Nous avons aussi indiqué le paramètre <code>template_name</code> pour la vue de liste <code>results</code>, ce qui permet de différencier l'apparence du rendu des vues  <code>results</code>  et <code>detail</code>, même s'il s'agit dans les deux cas de vues <code>DetailView</code> à la base.
</p>

<p>
De la même façon, la vue générique <code>ListView</code> utilise par défaut un gabarit appelé <code>&lt;nom app&gt;/&lt;nom modèle&gt;_list.html</code> ; nous utilisons <code>template_name</code> pour indiquer à <code>ListView</code> d'utiliser notre gabarit existant "<code>polls/index.html</code>".
</p>

<p>
Dans les parties précédentes de ce tutoriel, les templates ont été renseignés avec un contexte qui contenait les variables de contexte <code>question</code> et <code>latest_question_list</code>. Pour <code>DetailView</code>, la variable <code>question</code> est fournie automatiquement ; comme nous utilisons un modèle nommé <code>Question</code>, Django sait donner un nom approprié à la variable de contexte. Cependant, pour <code>ListView</code>, la variable de contexte générée automatiquement s'appelle <code>question_list</code>. Pour changer cela, nous fournissons l'attribut <code>context_object_name</code> pour indiquer que nous souhaitons plutôt la nommer <code>latest_question_list</code>. Il serait aussi possible de modifier les templates en utilisant les nouveaux nom de variables par défaut, mais il est beaucoup plus simple d'indiquer à Django les noms de variables que nous souhaitons.
</p>
</div>
</div>
</div>
