tutoriel.html


<div id="outline-container-org0784a3d" class="outline-2">
<h2 id="org0784a3d"><span class="section-number-2">13.</span> Introduction aux tests automatisés</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgb386f2d" class="outline-3">
<h3 id="orgb386f2d"><span class="section-number-3">13.1.</span> Que sont les tests automatisés ?</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Les tests sont des routines qui vérifient le fonctionnement de votre code. Dans les tests automatisés, le travail de test est fait pour vous par le système. 
</p>

<p>
Les tests peuvent se faire à différents niveaux. Certains tests s'appliquent à un petit détail (est-ce que tel modèle renvoie les valeurs attendues ?), alors que d'autres examinent le fonctionnement global du logiciel (est-ce qu'une suite d'actions d'un utilisateur sur le site produit le résultat désiré ?). 
</p>

<p>
Vous créez une seule fois un ensemble de tests, puis au fur et à mesure des modifications de votre application, vous pouvez contrôler que votre code fonctionne toujours tel qu'il devrait, sans devoir effectuer des tests manuels fastidieux.
</p>

<p>
L'écriture de tests est bien plus rentable que de passer des heures à tester manuellement votre application ou à essayer d'identifier la cause d'un problème récemment découvert.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Raoul Hatterer</p>
<p class="date">Created: 2024-08-21 Wed 22:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
